const RefundPolicyContent = () => {
	return (
		<section className="pt-4 px-[54.5px] pb-[65px]">
			<div className="text-[#87878A] font-suit text-xs font-bold leading-[150%] tracking-[0.12px] whitespace-pre-wrap">
				환불 및 취소 정책
				<br />
				<br />
				최종 수정일: [2024.06.04]
				<br />
				<br />
				1. 개요
				<br />
				[블루보이즈클럽] (이하 "회사" 또는 "당사")는 고객 만족을 최우선으로 합니다. 이 환불 및 취소 정책(이하 "정책")은
				당사의 디지털 콘텐츠(음악, 음원, 비트) 구매와 관련된 환불 및 취소 절차를 명확히 하기 위해 작성되었습니다. 고객의
				권리와 당사의 책임을 명확히 하여 원활한 서비스 이용을 돕고자 합니다.
				<br />
				<br />
				2. 환불 정책
				<br />
				환불 요청 기간:
				<br />
				디지털 콘텐츠의 특성상, 구매 후 환불이 불가능합니다. 모든 판매는 최종적이며, 구매 후에는 환불이 제공되지
				않습니다.
				<br />
				환불 예외 사항:
				<br />
				구매한 디지털 콘텐츠가 손상되었거나 다운로드할 수 없는 경우, 문제 해결을 위해 [info@hitbeatclub.com]로 연락해
				주십시오. 해당 문제를 해결하지 못할 경우, 제한적인 환불 또는 교환이 제공될 수 있습니다.
				<br />
				<br />
				3. 취소 정책
				<br />
				주문 취소:
				<br />
				결제 완료 후 즉시 다운로드가 가능한 디지털 콘텐츠는 취소가 불가능합니다. 구매 전에 모든 내용을 신중히 검토하시기
				바랍니다.
				<br />
				<br />
				4. 반품 정책
				<br />
				디지털 콘텐츠는 특성상 반품이 불가능합니다. 모든 구매는 비가역적이며, 구매 후에는 반품할 수 없습니다.
				<br />
				<br />
				5. 문제 해결 절차
				<br />
				기술적 문제:
				<br />
				디지털 콘텐츠 다운로드 중 문제 발생 시, [info@hitbeatclub.com]로 지원 요청을 해주십시오. 가능한 빨리 문제를
				해결하기 위해 최선을 다하겠습니다.
				<br />
				고객 지원:
				<br />
				문제 해결이 필요하거나 추가 지원이 필요한 경우, [info@hitbeatclub.com]로 연락해 주십시오.
				<br />
				<br />
				6. 책임 제한
				<br />
				콘텐츠 품질:
				<br />
				당사는 제공된 디지털 콘텐츠의 품질을 보증하기 위해 최선을 다하지만, 사용자의 장치 또는 소프트웨어와의 호환성에
				대해서는 보증하지 않습니다.
				<br />
				제3자 결제:
				<br />
				제3자 결제 수단을 통한 구매의 경우, 해당 결제 수단의 정책에 따릅니다. 당사는 제3자 결제 수단의 문제에 대해
				책임지지 않습니다.
				<br />
				<br />
				7. 변경 사항
				<br />
				정책 변경: <br />
				당사는 언제든지 이 정책을 수정할 권리가 있으며, 변경 사항은 웹사이트에 공지됩니다. 변경 후에도 계속해서 서비스를
				이용하면 변경된 정책에 동의하는 것으로 간주됩니다.
				<br />
				<br />
				8. 문의
				<br />
				연락처:
				<br />
				환불 및 취소와 관련된 문의는 [info@hitbeatclub.com]로 연락해 주십시오.
				<br />
				<br />
				<br />
				저작권 침해 정책
				<br />
				<br />
				지적 재산권 보호를 강력하게 옹호하는 블루보이즈클럽은 모든 형태의 저작권 침해를 금지합니다. 공연권, 복제권,
				기계적 권리, 동기화 권리, 녹음에 대한 디지털 공연권, 출판권, 마스터권 또는 기타 법적 권리를 포함하되 이에
				국한되지 않는 타인의 지적 재산을 직접적인 서면 허가 없이 샘플링하거나 사용하는 행위 적법한 소유자로부터의 거래는
				엄격히 금지됩니다.
				<br />
				<br />
				반복 침해자에 대한 당사의 3자 경고 정책은 귀하의 계정에 대해 사전 통지 없이 제정을 종료하거나 환불하는 등의
				조치를 취할 수 있다는 점을 유의하시기 바랍니다. 발생할 수 있는 모든 법적 결과에 대한 책임은 전적으로 사용자로서
				귀하에게 있습니다. 블루보이즈클럽은 회원 및/또는 당사 웹사이트 방문자가 수행한 저작권 침해 또는 불법 활동에 대해
				책임을 지지 않습니다. 여기에는 민사소송, 형사소송 또는 그러한 행위로 인해 발생할 수 있는 금전적 또는 기타 손해가
				포함되나 이에 국한되지 않습니다.
				<br />
				<br />
				블루보이즈클럽은 대한민국 저작권법에 따라 저작권 침해 주장을 신속하게 해결하기 위해 최선을 다하고 있습니다.
				저작권 침해를 신고하려면 info@hitbeatclub.com으로 문의 해주세요.
				<br />
				<br />
				<br />
				사기 정책
				<br />
				<br />
				서비스 약관 에 따라 블루보이즈클럽은 사기를 용납하지 않는 정책을 시행하고 있습니다. 당사의 재량에 따라 사기
				행위에 연루된 것으로 의심되는 당사 웹사이트 회원 및/또는 방문자는 다음 중 하나 이상의 결과를 받을 수 있습니다.
				<br />
				<br />
				1. 사기 혐의가 있는 사용자는 로열티 지급, 수입 또는 환불을 받을 수 없습니다.
				<br />
				2. 사기 혐의가 있는 사용자는 사전 통지 없이 즉시 계정을 영구적으로 폐쇄합니다.
				<br />
				3. 사기 혐의가 있는 사용자는 민사 소송의 대상이 될 수 있습니다.
				<br />
				4. 사기 혐의가 있는 사용자는 형사처벌을 받을 수 있습니다.
				<br />
				<br />
				귀하가 사기의 대상이거나 사기 시도의 대상이라고 생각되는 경우, 조사할 수 있도록 info@hitbeatclub.com 으로 문의
				해주세요.
			</div>
		</section>
	);
};

export default RefundPolicyContent;
