import Link from "next/link";

const TermsOfServiceContent = () => {
	return (
		<section className="pt-4 px-[54.5px] pb-[65px]">
			<div className="text-[#87878A] font-suit text-xs font-bold leading-[150%] tracking-[0.12px] whitespace-pre-wrap">
				서비스 이용약관
				<br />
				최종 수정일: 2024년 5월 29일
				<br />
				<br />
				소개
				<br />이 서비스 이용약관(이하 "약관")은 블루보이즈클럽 (이하 "회사" 또는 "당사")이 제공하는 히트비트클럽 이용에
				관한 규정을 명시합니다.
				<br />
				서비스를 이용함으로써 귀하는 이 약관에 동의하는 것으로 간주됩니다.
				<br />
				<br />
				서비스 이용
				<br />
				계정 생성:
				<br />
				<br />
				- 서비스를 이용하려면 계정을 생성해야 합니다. 계정 정보는 정확하고 최신이어야 하며, 타인의 정보를 도용해서는 안
				됩니다.
				<br />
				- 계정 생성 시 만 14세 미만의 미성년자는 보호자의 동의가 필요합니다.
				<br />- 개인정보처리방침은{" "}
				<Link
					href="/privacy-policy"
					className="text-[#87878A] font-suit text-xs font-bold leading-[150%] tracking-[0.12px] border-b-1 border-b-[#87878A]"
				>
					[개인정보처리방침링크]
				</Link>
				를 통해 확인하실 수 있습니다.
				<br />
				<br />
				이용 제한: 다음과 같은 행위는 금지되며 위반 시 법적 조치를 취할 권리를 보유합니다.
				<br />
				<br />
				- 불법적인 목적 또는 회사의 허가 없이 서비스를 이용하는 행위
				<br />
				- 타인의 권리 침해, 비방, 명예 훼손 또는 사생활 침해 행위
				<br />
				- 바이러스, 악성 코드 등의 전송 행위
				<br />
				<br />
				콘텐츠
				<br />
				사용자 콘텐츠:
				<br />- 사용자가 업로드한 모든 콘텐츠는 사용자가 소유하며, 사용자는 콘텐츠에 대한 모든 권리를 보유하고 있음을
				보증합니다.
				<br />
				- 사용자가 업로드한 콘텐츠에 대한 법적 책임은 사용자에게 있습니다.
				<br />
				<br />
				라이선스 부여:
				<br />
				<br />
				- 사용자는 홍보를 위한 무료 mp3음원과 판매를 위한 음원에 대한 독점권을 당사에 위탁합니다.
				<br />
				- 사용자는 당사에 서비스 운영, 홍보 등을 위해 사용자의 콘텐츠를 사용할 수 있는 비독점적, 무상, 전 세계적, 양도
				가능한 권리를 부여합니다.
				<br />
				<br />
				저작권 소유자:
				<br />
				<br />
				- 이 웹사이트의 모든 콘텐츠(텍스트, 이미지, 그래픽, 음악, 비디오, 소프트웨어, 코드 및 기타 자료)는
				블루보이즈클럽의 소유입니다.
				<br />
				<br />
				음원 판매 시 저작권 관련:
				<br />
				<br />
				- 음원을 상업적으로 발매할 때 구매자가 저작권 협회에 따로 음원에 대한 저작권자로 원작자를 등록하게 됩니다. 그 후
				저작권 협회를 통해 저작권료에 대한 분배를 받게 됩니다. <br />
				<br />
				허가된 사용:
				<br />
				<br />
				- 개인적인 용도로 콘텐츠를 다운로드하거나 인쇄하는 것은 허용됩니다. 그러나, 상업적 목적 또는 공개적으로 배포할
				경우, 사전에 서면으로 블루보이즈클럽의 허가를 받아야 합니다.
				<br />
				<br />
				금지된 행위:
				<br />
				<br />
				- 저작권 소유자의 명시적인 허가 없이, 콘텐츠를 복제, 배포, 수정, 전시, 전송, 출판, 라이센스하거나 파생 작업을
				만드는 것은 금지됩니다.
				<br />
				<br />
				상표:
				<br />
				<br />
				- 본 웹사이트에 나타나는 모든 상표, 로고 및 서비스 마크는 블루보이즈클럽 또는 그 관련 기업의 등록 상표입니다.
				이를 무단으로 사용하거나 오용하는 것은 법적으로 금지됩니다.
				<br />
				<br />
				면책 조항:
				<br />
				<br />
				- 본 웹사이트의 콘텐츠는 '있는 그대로' 제공되며, 특정 목적에 대한 적합성 또는 비침해성에 대한 명시적 또는
				묵시적인 보증을 포함하여 어떠한 보증도 제공하지 않습니다.
				<br />
				<br />
				결제 및 환불
				<br />
				결제:
				<br />
				<br />
				- 당사는 사용자의 결제 정보를 보호하기 위해 최선을 다합니다.- 유료 서비스는 결제 정보 입력 후 이용할 수 있으며,
				정확한 결제 정보를 제공해야 합니다.
				<br />
				<br />
				환불:
				<br />
				<br />- 환불 정책은{" "}
				<Link
					href="/refund-policy"
					className="text-[#87878A] font-suit text-xs font-bold leading-[150%] tracking-[0.12px] border-b-1 border-b-[#87878A]"
				>
					[환불 정책 링크]
				</Link>
				에서 확인할 수 있습니다.
				<br />- 디지털 콘텐츠의 특성상, 구매 후 환불이 불가능합니다.
				<br />- 모든 판매는 최종적이며, 구매 후에는 환불이 제공되지 않습니다.
				<br />
				<br />
				정산: <br />
				<br />- 구매자가 음원 구매 시 구매 금액을 블루보이즈클럽 10%(수수료), 음원공급자90%로 나누게 되고, 수수료를
				제외한 금액을 음원공급자에게 지급하게 됩니다. <br />
				<br />
				책임의 한계
				<br />
				서비스 제공:
				<br />
				<br />- 당사는 서비스를 "있는 그대로" 제공하며, 당사는 고의 또는 중대한 과실이 없는 한 특정 목적에 대한
				적합성이나 비침해성에 대한 명시적 또는 묵시적인 보증을 포함하지 않습니다.
				<br />
				<br />
				책임 제한:
				<br />
				<br />- 당사는 사용자의 서비스 이용으로 발생하는 간접적, 부수적, 특별 또는 결과적 손해에 대해 책임지지 않습니다.
				<br />
				<br />
				변경 사항
				<br />
				약관 변경:
				<br />
				<br />- 당사는 언제든지 약관을 수정할 권리가 있으며, 변경 사항은 서비스 내에 공지됩니다. 변경 후 서비스를 계속
				이용하면 변경된 약관에 동의하는 것으로 간주됩니다.
				<br />
				<br />
				준거법
				<br />
				법률 준수:
				<br />
				<br />- 이 약관은 대한민국의 법률에 따라 해석되고 적용됩니다.
				<br />- 이 약관에 관한 모든 분쟁은 서울중앙지방법원을 전속관할 법원으로 합니다.
				<br />
				<br />
				제재 조치
				<br />
				제재 조치:
				<br />
				<br />- 약관 위반 시, 당사는 사전 통지 없이 사용자의 계정을 일시 정지하거나 영구 정지할 수 있으며, 위반 콘텐츠를
				삭제할 수 있습니다. 또한, 법적 조치를 취할 권리를 보유합니다.
				<br />
				<br />
				특정 조항의 무효
				<br />
				특정 조항의 무효:
				<br />
				<br />- 이 약관의 특정 조항이 법적으로 무효 또는 집행 불가능하다고 판단될 경우, 해당 조항은 삭제되거나
				수정되어야 하며, 나머지 조항의 유효성 및 집행 가능성에는 영향을 미치지 않습니다.
				<br />
				<br />
				문의
				<br />
				연락처:
				<br />- 이용약관에 대한 문의는 info@hitbeatclub.com으로 연락해 주십시오.
				<br />
			</div>
		</section>
	);
};

export default TermsOfServiceContent;
