const PolicyPrivacyContent = () => {
	return (
		<section className="pt-4 px-[54.5px] pb-[65px]">
			<div className="text-[#87878A] font-suit text-xs font-bold leading-[150%] tracking-[0.12px] whitespace-pre-wrap">
				블루보이즈클럽(이하 "회사")은 개인정보 보호를 위하여 정보통신망 이용 촉진 및 정보보호 등에 관한 법률과
				개인정보보호법 등 관련 법령을 준수하고 있으며, 다음과 같은 개인정보처리 방침을 가지고 있습니다. 회사는 개인정보
				처리 방침을 통해 이용자의 개인정보가 어떠한 목적과 방식으로 수집되고 이용되며, 이용자의 개인정보 보호를 위해
				어떠한 조치를 취하고 있는지에 대해 안내합니다. 이 개인정보 처리 방침은 관련 법의 개정이나 회사의 정책에 따라
				변경될 수 있으며, 회사는 웹사이트를 통해 이를 공지하오니 웹사이트 이용 시에 수시로 확인해주시기 바랍니다.
				<br />
				<br />
				1. 개인정보의 처리 목적
				<br />
				"회사"는 수집한 개인정보를 다음과 같은 목적으로 활용합니다.
				<br />
				가. 서비스 제공을 위한 정보 활용: 서비스 이용에 따른 본인 확인, 콘텐츠 제공, 개인 식별, 부정 이용 방지와 비인가
				사용 방지, 음원 스트리밍 서비스 및 음원 구매 및 판매 서비스 제공, 혜택 제공 및 안내, 만족도 조사, 분쟁 조정을
				위한 기록 보존, 불만 민원 처리, 고지사항 전달을 위한 목적으로 활용합니다.
				<br />
				나. 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금 정산: 콘텐츠 제공, 계약서 발송, 구매 및 결제 시
				활용합니다.
				<br />
				다. 마케팅 및 광고에 활용: 신규 서비스 개발, 인구 통계학적 특성에 따른 서비스 제공 및 광고 게재, 접속 빈도 파악,
				서비스 이용에 대한 통계, 이벤트 경품 배송, 고객 지향적 이벤트와 광고성 정보 전달을 위한 목적으로 활용합니다.
				<br />
				<br />
				2. 개인정보의 처리 및 보유 기간
				<br />
				회사는 개인정보 수집 시 이용자에게 고지하고 동의 받은 보유 기간이 도래하면 해당 정보를 즉시 파기합니다. 다만,
				상법, 국세기본법, 전자상거래 등에서의 소비자 보호에 관한 법률 등 관련 법령의 규정에 따라 거래 관련 권리 의무
				관계 확인 등을 이유로 일정 기간 보유하여야 할 필요가 있을 경우 일정 기간 보유합니다. 보존 기간 및 보존 항목은
				다음과 같습니다.
				<br />
				- 구매 또는 판매 등에 관한 기록: 5년(전자상거래 등에서의 소비자보호에 관한 법률)
				<br />
				- 결제 및 재화 등의 공급에 관한 기록: 5년(전자상거래 등에서의 소비자보호에 관한 법률)
				<br />
				- 소비자 불만 또는 분쟁 처리에 관한 기록: 3년(전자상거래 등에서의 소비자보호에 관한 법률)
				<br />
				- 보존 항목: 이름, 이메일, 휴대전화번호, 주소 등<br />
				<br />
				3. 개인정보 제3자 제공에 관한 사항
				<br />
				"회사"는 고객의 별도 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조에 해당하는 경우 외에는 개인정보를
				제3자에게 제공하지 않습니다.
				<br />
				<br />
				4. 개인정보의 위탁에 관한 사항
				<br />
				"회사"는 서비스 이행을 위해 다음과 같이 개인정보 처리 업무를 외부에 위탁하고 있습니다. 위탁 계약 시 개인정보가
				안전하게 보호될 수 있도록 위탁 업무 수행목적 외 개인정보 처리금지, 재위탁 제한, 위탁 업체에 대한 관리·감독을
				시행하고 있습니다.
				<br />
				가. 서버 호스팅
				<br />
				- 위탁받는 자: Bubble.io
				<br />
				- 위탁하는 업무의 내용: 웹사이트 호스팅 및 관리
				<br />
				- 위탁 기간: 계약 종료 시까지
				<br />
				나. 결제 처리
				<br />
				- 위탁받는 자: NICE페이먼츠(주)
				<br />
				- 위탁하는 업무의 내용: 결제 처리
				<br />
				- 위탁 기간: 계약 종료 시까지
				<br />
				<br />
				5. 정보주체와 법정대리인의 권리·의무 및 행사 방법
				<br />
				이용자 및 법정대리인은 "회사"에 대해 언제든지 다음의 개인정보 보호 관련 권리를 행사할 수 있습니다. 담당자에게
				전화 또는 전자우편 주소로 연락하시면 본인 확인 절차 후 조치하겠습니다.
				<br />
				1) 개인정보 열람, 정정, 삭제 요구의 권리
				<br />
				2) 개인정보 수집, 이용, 제공에 대한 동의 철회의 권리
				<br />
				<br />
				6. 처리하는 개인정보 항목
				<br />
				회사는 서비스 제공을 위해 필요한 최소한의 개인정보를 수집합니다. 모든 이용자는 회사가 제공하는 서비스를 이용할
				수 있고, 회원 가입을 통해 더욱 다양한 서비스를 제공받을 수 있습니다.
				<br />
				-판매고객 수집 항목: 성명, 주소, 휴대전화번호, 은행 계좌번호
				<br />
				-구매고객 수집 항목: 성명, 주소, 휴대전화번호, 이메일
				<br />
				<br />
				7. 개인정보의 파기
				<br />
				"회사"는 개인정보 보유 기간의 경과, 처리 목적 달성 등 개인정보가 불필요하게 되었을 때는 지체 없이 해당
				개인정보를 파기합니다. "회사"는 다음의 방법으로 개인정보를 파기합니다.
				<br />
				- 전자적 파일: 파일 삭제 및 저장매체 포맷
				<br />
				- 종이 문서: 분쇄하거나 소각
				<br />
				<br />
				8. 개인정보의 안전성 확보 조치
				<br />
				"회사"는 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.
				<br />
				- 관리적 조치: 내부관리계획 수립·시행, 직원에 대한 정기적 교육, 보안서약서 작성
				<br />
				- 기술적 조치: 개인정보 접근권한 관리, 보안프로그램 설치
				<br />
				<br />
				9. 개인정보 자동 수집 장치의 설치·운영 및 거부에 관한 사항
				<br />
				"회사"는 고객에게 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로 불러오는 '쿠키(cookie)'를
				사용합니다.
				<br />
				- 사용 목적: 고객의 접속빈도 또는 머문 시간 등을 분석, 취향과 관심분야를 파악하여 서비스 개선에 활용
				<br />
				- 설치·운영 및 거부: 웹 브라우저 상단의 도구 &gt; 인터넷 옵션 &gt; 개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을
				거부할 수 있습니다. 단, 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.
				<br />
				<br />
				10. 개인정보 보호책임자
				<br />
				"회사"는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제를
				처리하기 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
				<br />
				- 개인정보 보호 책임자: 현태웅
				<br />
				- 이메일: info@hitbeatclub.com
				<br />
				- 전화번호: 010-8680-2015
				<br />
				<br />
				11. 개인정보 처리 방침 변경
				<br />이 개인정보 처리 방침은 2024년 6월 5일부터 적용됩니다.
			</div>
		</section>
	);
};

export default PolicyPrivacyContent;
