import { Fragment } from "react";

const terms = `
제1장 총칙

제1조 (목적)
본 약관은 블루보이즈클럽(대표자: 현태웅, 이하 "회사")가 운영하는 서비스인 히트비트클럽(이하 "본 서비스")을 이용하여 비트, 아카펠라 등 콘텐츠를 거래하는 회원 간 또는 회원과 회사 간의 권리, 의무, 책임사항 및 회원의 본 서비스 이용조건 및 절차 등 기본적인 사항을 규정하여 회원의 권익을 보호함을 목적으로 합니다.

제2조 (용어의 정의)
본 약관에서 사용하는 용어의 정의는 다음 각 호와 같습니다.
본 서비스: 판매회원이 제공하는 상품과 같은 디지털 콘텐츠를 본 약관에 제시된 조건에 따라 구매회원이 구매 또는 이용할 수 있도록 회사에서 제공하는 디지털 콘텐츠 중개 서비스 및 관련 정보 제공•유통 서비스
상품: 회사에서 제공하는 양식에 맞추어 판매회원이 판매 또는 전송을 위하여 등록한 프로그램 또는 콘텐츠, 실물 상품 등을 의미함
회원: 홈페이지 또는 앱에 접속하여 본 약관에 동의하고, 아이디(ID)와 비밀번호(PASSWORD)를 발급받거나 휴대용 단말기 또는 PC용 소프트웨어에서 본 약관에 동의하고, 해당 단말기를 등록하여 본 서비스를 이용할 수 있는 개인이나 법인 고객
구매회원: 본 서비스를 이용하여 상품을 구매하는 고객
판매회원: 본 서비스를 이용하여 상품을 판매하거나 전송하는 개인이나 법인 고객
운영자: 본 서비스의 전반적인 관리와 원활한 운영을 위하여 회사가 선정한 자
게시물: 회원이 본 서비스를 이용하면서 본 서비스에 게시한 부호ㆍ문자ㆍ소리ㆍ화상ㆍ동영상ㆍ기타 정보 형태의 글, 사진 및 각종 파일과 링크
본 약관에서 사용하는 용어의 정의는 본 조 제1항에서 정하는 것을 제외하고는 관계 법령과 서비스별 안내에서 정하는 바를 따릅니다.

제3조 (약관의 효력 및 변경)
본 약관은 본 서비스를 이용하고자 하는 모든 회원에게 그 효력을 발생합니다.
회사는 필요하다고 인정되면 본 약관을 변경할 수 있으며, 회사가 약관을 변경할 때에는 적용일자와 변경사유를 밝혀 그 적용일자 7일 전부터 앱 또는 홈페이지를 통하여 공지합니다. 다만, 회원에게 불리한 약관 변경의 경우 그 적용일자 30일 전부터 공지하며, 이메일(E-mail) 또는 문자메시지(SMS) 등으로 회원에게 개별 통지합니다(회원이 연락처를 기재하지 않았거나 변경하여 개별 통지가 어려울 때에는 홈페이지에 변경 약관을 공지하는 것을 개별 통지한 것으로 간주합니다.).
회사가 본 조 제2항에 따라 변경 약관을 공지하거나 통지하면서, 회원이 약관 변경 적용일까지 거부 의사를 표시하지 않으면 약관의 변경에 동의한 것으로 간주한다는 내용을 공지 또는 통지하였음에도 회원이 변경된 약관의 효력 발생일까지 약관 변경에 대한 거부 의사를 표시하지 않을 때에는 회원이 변경 약관에 동의한 것으로 간주합니다. 회원은 변경된 약관에 동의하지 않으면 본 서비스 이용을 중단하고 이용계약을 해지할 수 있습니다.
본 약관에 동의하는 것은 회사가 운영하는 본 서비스의 홈페이지를 정기적으로 방문하여 약관의 변경사항을 확인하는 것에 동의함을 의미합니다. 변경된 약관에 대한 정보를 알지 못하여 발생하는 회원의 피해에 대하여 회사는 책임이 없습니다.
회사는 이용자가 요구하면 본 약관의 사본을 이용자에게 교부하며, 이용자가 홈페이지에서 본 약관을 인쇄할 수 있도록 조치합니다.

제4조 (약관 외 준칙)
본 약관에 밝히지 않은 사항은 전기통신기본법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계 법령 및 회사가 정한 서비스의 세부이용지침 등의 규정을 따릅니다.
회사는 필요하면 특정 서비스에 적용될 사항(이하 "개별약관")을 정하여 이를 제3조 제2항의 방법에 따라 공지할 수 있습니다.
회사는 필요하면 본 서비스 이용과 관련된 세부이용지침을 정하여 이를 제3조 제2항의 방법에 따라 공지할 수 있습니다.
본 약관과 관련하여 회사의 정책 변경, 법령의 제•개정 또는 공공기관의 고시나 지침 등에 따라 회사가 홈페이지의 공지사항 게시판 등을 통해 공지하는 내용도 이용계약의 일부를 구성합니다.

제2장 서비스 이용계약
제5조 (이용신청)
회원가입을 하지 않더라도, 서비스 내 음원(비트, 아카펠라 등)듣기 및 검색은 할 수 있으나, 추가적인 기능을 활용하기 위하여서는 회원가입을 하여야 합니다.
본 서비스에 가입하여 서비스를 이용하고자 하는 자는 휴대용 단말기 또는 PC용 소프트웨어에서 본 약관에 동의하고, 회원가입 절차를 밟아야 합니다
본 서비스에 가입하여 서비스를 이용하고자 하는 자는 회사에서 제공한 회원가입 신청양식에 따라 필요사항을 기재하여야 합니다. 회원 가입 때 기재할 항목은 필수 기재 항목과 선택 기재 항목으로 구분되어 있으며 필수 기재 항목은 반드시 입력해야 합니다. 선택 기재 항목 중 일부 항목은 상품을 구매할 때 반드시 입력해야 합니다.
회사는 본 서비스에 가입하여 이용하고자 하는 자에게 "문자메시지(SMS) 인증", 기타 본인을 확인할 수 있는 인증 절차를 요구할 수 있습니다. 이때 본 서비스에 가입하여 이용하고자 하는 자는 해당 인증을 수행하는 등 가입 절차를 완료해야 합니다.
전 항에 따른 인증의 정확성을 위하여 본 서비스에 가입하여 이용하고자 하는 자는 본인 명의의 이동전화를 이용하여 인증절차를 수행해야 합니다. 본인의 관리 소홀로 타인이 본인 명의의 인증절차를 수행하거나 본인이 타인의 명의를 무단으로 사용하여 인증을 수행했을 때 발생하는 불이익과 기타 손해에 대해 회사는 책임을 지지 않습니다.

제6조 (이용계약의 성립)
이용계약은 회원이 되고자 하는 자(이하 "가입신청자")가 본 약관의 내용에 대하여 동의한 후 회원가입 신청 양식에 따라 필요한 항목을 기재하여 제출하는 방법으로 회원가입을 신청하고, 회사가 위 신청을 승낙하면 체결됩니다.

제7조 (이용신청에 대한 승낙 유보 및 서비스 이용의 제한)
제6조에 따른 가입신청자에게 회사는 원칙적으로 본 서비스의 이용을 승낙합니다. 단, 회사는 다음 각 호에 해당하는 신청은 그 사유가 해소될 때까지 승낙을 유보하거나, 승낙을 거부할 수 있습니다.
다른 사람의 명의를 사용하거나 이동전화 명의자의 허락 없이 문자메시지(SMS) 인증, 범용공인 인증 또는 신용카드 인증을 수행하는 등 이용자를 등록할 때 허위로 신청하는 경우
회사에 의하여 이용계약이 해지된 날로부터 2개월 이내에 재이용을 신청하는 경우
기술상 서비스를 제공할 수 없는 경우
고객 등록 사항을 빠뜨리거나 잘못 기재하여 신청하는 경우
이메일(E-mail) 승인 또는 문자메시지(SMS) 인증 등 회사가 정한 인증 절차를 완료하지 않은 경우
만 14세 미만의 아동에 해당하는 경우
가입신청자가 회원 자격을 잃은 사실이 있는 경우, 단, 회원 자격을 잃은 날로부터 1년이 지난 자로서 회사의 재가입 승낙을 얻었을 때에는 그렇지 않습니다.
회사로부터 회원자격정지 조치 등을 받은 회원이 그 조치 기간에 이용계약을 임의로 해지하고 재이용을 신청하는 경우
사회의 안녕질서 또는 미풍양속을 저해하거나, 저해할 목적으로 신청한 경우
자금을 세탁할 목적 또는 자금세탁으로 의심되는 경우
기타 회사가 정한 이용신청 요건을 만족시키지 않았거나 위법 또는 부당한 이용신청임이 확인된 경우 또는 회원의 책임 있는 사유로 회사가 승낙할 수 없는 경우
본 조 제1항에 따라 회사가 회원가입 신청의 승낙을 유보하거나 거절했을 때에는 회사는 이용신청자에게 승낙 유보의 사유, 승낙 가능시기 또는 승낙에 필요한 추가 요청 정보나 자료 등 기타 승낙 유보, 거절과 관련된 사항을 해당 서비스 화면에 게시하거나 이메일(E-mail) 등을 통하여 통지합니다.
회사는 본 서비스의 품질 향상 등 필요한 경우가 있으면, 회원을 등급별로 구분하여 이용시간, 이용횟수, 서비스 메뉴, 기타 필요한 사항을 세분하여 그 이용에 차등을 둘 수 있습니다.
회사는 회원에게 청소년보호법 기타 관련 법령에 따른 등급 및 연령 준수를 위하여 이용제한이나 등급별 제한, 기타 필요한 조치를 할 수 있습니다.
회원이 본 약관에 동의함은 본 서비스와 관련하여 회사에서 제공하거나 제공할 모든 서비스에 동의하는 것으로 봅니다.

제3장 서비스 이용
제8조 (서비스의 제공 내용 및 요건 등)
회사는 회원에게 다음 각 호의 서비스를 제공합니다.
전자상거래 서비스: 회사가 홈페이지를 통하여 회원 간에 상품의 거래가 이루어질 수 있도록 온라인 거래장소를 제공하는 서비스 및 관련 부가서비스를 말합니다.
판매 관련 지원 서비스
구매 관련 지원 서비스
계약체결, 결제 지원 서비스
상품 검색정보 서비스
기타 전자상거래 관련 서비스
판매회원이 판매하는 상품과 관련한 업데이트 등은 해당 판매회원이 제공하는 것으로서 회사는 이에 대하여 고의, 과실이 없는 한 책임을 지지 않습니다. 
회사는 구매회원이 구매하는 상품의 종류에 따라 상품구매방법, 업데이트 방법 등이 달라질 수 있어, 그에 따라 회사가 지정하는 타사의 디지털 콘텐츠 중개 서비스를 안내 및 제공할 수 있으며, 상세 내용을 별도로 정하여 공지합니다.
판매회원이 판매하는 상품에 다음 각 호의 사유가 있으면 회사는 상품을 업데이트 또는 삭제할 수 있습니다.
심각한 Network 장애를 발생시키는 경우
바이러스 또는 악성코드가 포함되어 있는 경우

제9조 (대리행위 및 보증의 부인)
회사는 구매회원과 판매회원 간 자유로운 상품의 거래를 위한 시스템을 운영•관리•제공할 뿐이므로 구매회원 또는 판매회원을 대리하지 않으며, 회원 사이에 성립된 거래와 관련된 책임과 회원이 제공한 정보에 대한 책임은 해당 회원이 직접 부담해야 합니다. 단, 회사가 판매하는 상품에 대해서 회사는 판매자로서 책임을 다합니다.
회사는 본 서비스를 통하여 이루어지는 구매회원과 판매회원 간의 거래와 관련하여 판매의사 또는 구매의사의 존부 및 진정성, 등록상품의 품질, 완전성, 안정성, 적법성 및 타인의 권리에 대한 비침해성, 구매회원 또는 판매회원이 입력하는 정보 및 그 정보를 통하여 링크된 URL에 게재된 자료의 진실성 또는 적법성 등 일체를 보증하지 않으며, 이와 관련한 일체의 위험과 책임은 해당 회원이 전적으로 부담합니다.

제10조 (서비스의 제공 기간과 이용시간)
회원에게 본 서비스를 제공하는 기간은 회원의 본 서비스 이용신청을 회사가 승낙한 날로부터 본 서비스의 이용계약을 해지하거나 본 서비스를 종료할 때까지 입니다.
서비스의 이용은 연중무휴 1일 24시간을 원칙으로 합니다.
회사는 서비스를 일정 범위로 나누어 각각의 범위에서 이용할 수 있는 시간을 별도로 정할 수 있으며 그럴 때에는 그 내용을 공지합니다.
회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있는 경우에 앱 마켓 이용을 일시적으로 중지할 수 있습니다. 
제4항의 경우, 회사는 그 사실을 사전에 회원에게 통지합니다. 다만, 회사가 사전에 통지할 수 없는 부득이한 사유가 있는 경우에 사후에 통지할 수 있습니다. 
회사는 원활한 앱 마켓 운영을 위해 필요한 경우에 정기점검을 실시할 수 있으며, 사전에 정기점검시간을 공지합니다. 

제11조 (상품의 구매)
구매계약은 회원이 판매회원이 제시한 상품의 판매 조건에 응하고 구매하겠다는 의사표시를 했을 때 체결됩니다.
회사는 회원이 상품을 구매하기 전에 판매회원의 성명, 상호, 주소와 더불어 회사가 통신판매 당사자가 아닌 경우 해당 사실, 개별 상품의 이용에 필요한 최소한의 기술사양[안드로이드 운영체제(OS), 시스템 소프트웨어(SW) 사양 등, 다만 상품의 특성상 이러한 정보가 불필요할 때에는 그렇지 않음] 등 전자상거래 등에서의 소비자보호에 관한 법률 등 관계 법령에서 규정하는 정보를 회원에게 미리 알립니다.
회원은 상품을 구매하기 전에 반드시 본 조 제1항의 사항 및 판매회원이 홈페이지 내에 작성한 상품의 상세 내용과 거래의 조건을 정확하게 확인해야 합니다. 구매하려는 상품의 내용과 거래 조건을 확인하지 않고 구매하여 발생한 모든 손해에 대한 책임은 회원 본인에게 있습니다.
상품 판매 대금의 결제와 관련하여 구매회원이 입력한 정보 및 그 정보와 관련하여 발생한 책임과 불이익은 전적으로 구매회원이 부담해야 합니다.
회사는 회원이 현금, 카드 기타의 방법으로 매매 대금을 결제할 수 있는 방법을 제공합니다.
미성년자인 회원이 법정 대리인(부모 등)의 동의 없이 상품을 구매하거나 계약 체결 후 법정 대리인이 추인하지 않으면 민법상 취소권을 행사할 수 있습니다. 다만, 민법상 취소권이 제한될 때(미성년자가 성년자의 주민등록번호, 결제 정보 등을 회사에 제공하여 성년으로 믿게 한 경우, 회사가 통신과금서비스 이용 동의를 이미 얻은 경우 등)에는 취소할 수 없습니다.

제12조 (상품의 결제)
판매회원은 상품의 가격을 정하며, 회사는 판매회원의 상품 가격 결정에 일절 관여하지 않습니다.
구매회원은 판매회원이 대금결제화면에서 표시한 지급방법에 따라 상품에 대한 대금을 지급합니다. 상품을 결제할 때는 결제대행사에 지급해야 하는 결제대행수수료를 포함하여 결제합니다. 
회사는 필요하다고 인정하면 본 조 제1항과 제2항에 규정된 사항을 변경할 수 있습니다.

제13조 (청약철회 등에 관한 규정)
전자상거래 등에서의 소비자보호에 관한 법률 등 관련법령이 정하는 바에 따라 구매회원은 판매회원에게 직접 또는 회사를 통하여 청약철회, 반품 요청 등을 할 수 있습니다. 
구매회원이 구매하는 상품은 구매 즉시 이용할 수 있는 상태가 되거나 이용하는 것으로 볼 수 있다면 그 상품의 성격상 그리고 관계 법령(전자상거래 등에서의 소비자보호에 관한 법률, 콘텐츠산업진흥법상의 청약철회 불가 사유 해당 등)상 구매 후에는 청약철회가 불가능할 수 있습니다. 다만, 그럴 때 회사 또는 판매회원은 청약철회가 불가능하다는 사실을 표시사항에 포함하거나 시험상품을 제공하는 등의 조치를 합니다.
회사는 필요하면 청약철회 등을 요청하는 구매회원에게 청약 철회 등에 대한 자료의 제공을 요청할 수 있습니다.
청약 철회, 환급 요청 기간은 관련 법령(전자상거래 등에서의 소비자보호에 관한 법률 등)에서 규정하는 기간을 따르며, 구체적인 기간은 다음과 같습니다.
유료 상품을 공급받은 날 또는 상품 공급에 대한 계약서, 통지 등을 받은 날로부터 7일 이내
공급된 상품의 내용이 표시•광고된 내용과 다르거나 계약 내용과 다르게 이행되었을 때에는 해당 상품을 공급받은 날로부터 3개월 이내, 또는 그 사실을 알거나 알 수 있었던 날로부터 30일 이내
본 조 제1항에 따라 청약을 철회한 구매회원은 제공받은 상품을 반환해야 하며, 내려받은 콘텐츠 등과 같이 반환하더라도 동일한 상품이 구매회원에게 남아 있으면 해당 상품을 삭제해야 합니다.
판매회원은 본 조 제5항에 따라 관련 법령(전자상거래 등에서의 소비자보호에 관한 법률 등)에서 규정하는 기간 내에 지급받은 상품 대금이 있으면 환급하여야 하며, 이때 구매회원이 해당 상품을 이용하여 얻은 이익이 있으면 해당 금액을 공제하고 환급할 수 있습니다.
판매회원은 구매회원에게 대금을 환급할 때 이용대금의 결제와 동일한 방법으로 결제 대금의 전부 또는 일부를 환급하며, 동일한 방법으로 환급할 수 없을 때에는 대안을 제시하며 이용자의 선택에 따라 환급합니다.
판매회원에 관한 정보는 각 판매회원의 상품정보 페이지에서 확인할 수 있으며, 자세한 내용은 '마이>고객센터"를 참고하시기 바랍니다.

제14조 (개별 상품의 하자 등으로 인한 회원의 구매 계약 해제•해지)
구매회원은 다음 각 호의 사유가 있으면 개별 상품의 구매계약을 해제하거나 해지할 수 있습니다. 이때 회사 또는 판매회원은 필요하면 다음 각 호의 사유를 입증할 자료를 구매회원에게 요청할 수 있습니다.
상품의 제공 시기가 있었으나 그 제공 시기까지 상품이 제공되지 않은 경우
하자 있는 상품을 제공한 탓에 구매회원이 이용목적을 달성할 수 없는 경우
1개월 동안 기간제 상품이나 스트리밍 방식의 계속적 온라인 콘텐츠 등에서 이용 중지 또는 장애 발생 누적시간이 72시간을 초과한 경우
기타 법률에 규정되어 있거나 당사자가 합의한 경우
구매회원이 본 조 제1항 1호 또는 2호의 사유로 개별 상품에 대한 이용계약을 해제하거나 해지하려면 상당한 기간을 정하여 회사 또는 판매회원에게 상품을 이용할 수 있게 하거나 하자 없는 상품을 제공하도록 요구해야 합니다. 다만, 구매회원이 해당 상품의 제공 시기에 상품을 받지 않아 그 계약의 목적을 달성할 수 없었거나 회사가 미리 상품을 제공하지 못한다는 사실을 밝혔을 때에는 그렇지 않습니다.
구매회원이 본 조에 따라 상품 구매계약을 해제하거나 해지했다면, 구매회원은 상품을 원상회복하여 반환해야 하며 회사 또는 판매회원은 구매회원이 상품을 이용한 기간에 해당하는 요금을 공제한 나머지를 구매회원에게 반환합니다. 단, 해당 상품이 무료 상품이거나 구매회원이 비용을 직접 지급하지 않는 상품일 때에는 반환 의무를 부담하지 않습니다.
구매회원이 회사의 고의, 과실 등 귀책사유로 본 조에 따라 개별 상품 구매 계약을 해제하거나 해지했을 때는 회사에 손해배상을 청구할 수 있습니다. 다만, 회사가 고의 또는 과실이 없으면 그렇지 않습니다.

제15조 (서비스의 변경 및 중단)
회사는 본 서비스를 변경하여 제공할 수 있습니다. 이때 회사는 변경될 서비스의 내용과 제공일자를 제3조 제2항에서 정한 방법으로 회원에게 공지하거나 통지합니다.
회사는 다음 각 호에 해당하면 본 서비스의 전부 또는 일부를 제한하거나 중단할 수 있습니다.
서비스용 설비의 보수 등 공사로 부득이한 경우
회원이 회사의 영업활동을 방해하는 경우
정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 경우
서비스 제공업자와의 계약 종료 등과 같은 회사의 제반 사정으로 본 서비스를 유지할 수 없는 경우
기타 천재지변, 국가비상사태 등 불가항력의 사유가 있는 경우
회사가 본 조 제2항에 따라 본 서비스를 중단할 때에는 제3조 제2항에서 정한 방법으로 이용자에게 해당 사실을 통지합니다. 다만, 통제할 수 없는 사유로 본 서비스가 중단(운영자의 고의, 과실이 없는 디스크 장애, 시스템 다운 등)되어 회사가 미리 통지할 수 없을 때에는 그렇지 않습니다.
회사는 본 서비스의 변경, 중단으로 발생하는 문제에 대해서 회사에 고의, 과실이 없는 한 어떠한 책임도 지지 않습니다.

제16조 (서비스 이용료, 과오금 환급)
회사는 본 서비스의 일부 특정 서비스 또는 기능을 제공할 때 이용료를 부과할 수 있습니다.
본 조 제1항의 이용료는 본 조 및 개별 약관 또는 별도 신청서에서 정하는 바에 따릅니다.
과오금이 발생하면 회사는 서비스 이용 대금의 결제와 동일한 방법으로 과오금을 환급합니다. 다만, 동일한 방법으로 환급할 수 없는 때에는 대안을 제시하고 구매회원의 선택에 따라 과오금을 환급합니다.
회사의 책임 있는 사유로 과오금이 발생하였다면 회사는 계약 비용, 수수료 등에 관계없이 과오금 전액을 환불합니다. 다만, 이용자의 책임 있는 사유로 과오금이 발생하였다면, 회사는 과오금을 환급하는 데 드는 비용을 합리적인 범위 내에서 공제하고 환급할 수 있습니다.

제17조 (정보의 제공 및 광고의 게재)
회사는 본 서비스를 운영하는 데 필요한 각종 정보를 서비스 화면에 게재하거나 이메일(E-mail), 서신 우편, 문자메시지(SMS/MMS) 등의 방법으로 회원에게 제공할 수 있습니다.
회사는 회사 또는 개별 서비스 관련 각종 광고를 서비스 화면에 게재하거나 회원의 동의를 얻어 이메일(E-mail), 서신 우편, 문자메시지(SMS/MMS), 텔레마케팅(TM) 등의 방법으로 회원에게 제공할 수 있습니다.
회원이 본 서비스상에 게재된 광고를 이용하거나 본 서비스를 통한 광고주의 판촉활동에 참여하는 등 광고주와 교신하거나 거래하는 것은 전적으로 회원과 광고주 간의 문제입니다. 그러므로 만약 회원과 광고주 간에 분쟁이 발생하면 이를 회원과 광고주가 직접 해결해야 하며, 이와 관련하여 회사는 어떠한 책임도 지지 않습니다.

제18조 (게시물 또는 내용물의 삭제)
회사는 회원이 게시하거나 전달하는 모든 게시물이 다음 각 호의 경우에 해당한다고 판단되면 제한의 범위, 기간, 사유 등을 전자우편 등의 방식으로 회원에게 개별 통지하고 게시판에의 접속을 제한할 수 있습니다.
회사, 다른 회원 또는 제3자를 비방하거나 중상모략으로 명예를 손상하는 내용인 경우
공공질서와 미풍양속을 거스르는 내용의 게시물을 유포하는 경우
범죄 행위에 결부된다고 인정되는 내용인 경우
회사 또는 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우
본 조 제2항의 세부이용지침을 통하여 회사에서 규정한 게시기간을 초과한 경우
불필요하거나 승인되지 않은 광고와 판촉물을 게재하는 경우
기타 관계 법령과 회사의 지침 등에 위반된다고 판단되는 경우
회사는 게시물과 관련된 세부이용지침을 별도로 정하여 시행할 수 있으며, 회원은 그 지침을 따라 각종 게시물을 등록하거나 삭제해야 합니다.

제19조(임의의 임시조치) 
회사는 게시물이 사생활 침해 또는 명예훼손 등 타인의 권리를 침해한다고 인정되면 임의로 해당 정보에 대한 접근을 임시적으로 차단하는 조치(이하 "임시조치")를 취할 수 있습니다. 
제1항에 따른 임시조치를 취한 앱 마켓사업자는 임시조치의 사실을 그 정보가 게시된 게시판 등에 공시하는 등의 방법으로 이용자가 알 수 있게 합니다. 
제1항에 따른 임시조치의 기간은 30일 이내로 합니다. 

제20조(정보의 삭제요청 등)
본 서비스를 통하여 일반에게 공개를 목적으로 제공된 정보로 사생활 침해나 명예훼손 등 타인의 권리가 침해된 경우, 그 침해를 받은 자는 해당 정보를 처리한 앱 마켓사업자에게 침해사실을 소명하여 그 정보의 삭제 또는 반박내용의 게재(이하 "삭제등")를 요청할 수 있습니다. 
회사는 제1항에 따른 해당 정보의 삭제등을 요청받으면 지체 없이 삭제ㆍ임시조치 등의 필요한 조치를 하고, 즉시 신청인 및 정보게재자에게 알립니다. 이 경우, 회사는 필요한 조치를 한 사실을 해당 게시판에 공시하는 등의 방법으로 이용자가 알 수 있도록 합니다. 
회사는 앱 마켓에 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」제42조에 따른 표시방법을 지키지 아니하는 청소년유해매체물이 게시되어 있거나 같은 법 제42조의2에 따른 청소년 접근을 제한하는 조치 없이 청소년유해매체물을 광고하는 내용이 전시되어 있는 경우에는 지체 없이 그 내용을 삭제합니다. 
제1항에 따른 정보의 삭제요청에도 불구하고, 앱 마켓사업자는 권리의 침해 여부를 판단하기 어렵거나 이해당사자 간에 다툼이 예상되는 경우에 제19조에 따른 임시조치를 취할 수 있습니다. 

제21조 (상품의 지식재산권)
판매회원이 본 서비스를 이용하여 판매하는 상품의 저작권과 기타 지식재산권은 판매회원 본인에게 있으며, 해당 상품이 타인의 저작권과 기타 권리를 침해했을 때 그에 대한 책임은 판매회원 본인이 부담합니다.
구매회원은 본 서비스를 통해 판매회원으로부터 판매회원과 체결한 구매계약에서 정한 조건에 따라 상품의 저작권, 이용권 등을 구매하는 것이며, 구매회원은 판매회원과 체결한 구매계약의 거래 조건에 따라 상품을 사용할 수 있습니다.

제22조 (게시물의 지식재산권)
회원이 본 서비스 내에 게시한 게시물에 대한 저작권과 그 관련 책임은 해당 회원에게 있습니다.
회사는 회원이 본 서비스 내에 게시한 게시물이 타인의 저작권 등 지식 재산권을 침해하더라도 이에 대해 민•형사상의 책임을 부담하지 않습니다.
회사는 회원의 동의를 받고 게시물을 이용하며, 이 경우 회사는 회원의 게시물을 홍보 등의 목적으로 이용할 수 있습니다.
회사는 회원이 이용계약을 해지하고 가입을 탈퇴하거나 본 약관에 따른 적법한 사유로 회원의 이용계약이 해지되었을 때에는 해당 회원이 게시하였던 게시물을 삭제할 수 있습니다.
회사가 작성한 저작물에 대한 저작권은 회사에 귀속됩니다.
회원은 본 서비스를 이용하여 얻은 정보를 가공•판매하는 행위 등 본 서비스에 게재된 자료를 영리 목적으로 이용하거나 제3자에게 이용하게 할 수 없으며, 게시물에 대한 저작권 침해는 관계 법령의 적용을 받습니다.

제4장 계약당사자의 의무
제23조 (회사의 의무)
회사는 본 서비스 제공과 관련하여 알게 된 회원의 개인정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다. 단, 관계 법령에 따른 수사상의 목적으로 관계 기관으로부터 요구를 받는 등 법률의 규정에 따른 적법한 절차에 의한 경우에는 그렇지 않습니다.
회사는 본 서비스와 관련한 회원의 불만사항이 고객센터를 통하여 접수되면 이를 신속하게 처리해야 하며, 신속한 처리가 어렵다면 그 사유와 처리 일정을 본 서비스 화면에 게재하거나 이메일(E-mail) 등을 통하여 해당 회원에게 통지합니다.
회사가 제공하는 서비스로 회원에게 손해가 발생하였다면 회사는 그러한 손해가 회사의 고의나 과실 때문에 발생했을 때에만 책임을 부담하며, 그 책임의 범위는 통상손해에 한정됩니다. 다만, 특별한 사정으로 회원에게 손해가 발생하였을 때 회사가 그 사정을 알았거나 알 수 있었다면 회사는 배상할 책임이 있습니다.
회사는 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 통신비밀보호법, 전기통신사업법 등 본 서비스의 운영, 유지와 관련한 법규를 지킵니다.

제24조 (회원의 의무)
회원은 본 서비스를 이용할 때 다음 각 호에 해당하는 행위를 해서는 안 됩니다.
회사가 제공하는 서비스 이용방법을 따르지 않고 비정상적인 방법으로 본 서비스를 이용하거나 시스템에 접근하는 행위
이용신청 또는 개인정보 변경 때 거짓된 정보를 적거나 다른 회원의 아이디(ID)와 비밀번호(PASSWORD), 카드정보, 계좌정보 등을 무단으로 사용하거나 부정하게 사용하는 행위
회사의 직원이나 운영자로 가장하거나 사칭하여 또는 타인의 명의를 무단으로 사용하여 글을 게시하거나 메일을 발송하는 행위
타인으로 가장하는 행위 및 타인과의 관계를 허위로 명시하는 행위
다른 회원의 개인정보를 무단으로 수집•저장•공개하는 행위
타인의 명예를 손상하거나 불이익을 주는 행위
회사 또는 제3자의 저작권 등 기타 권리를 침해하는 행위
게시판 등에 음란물을 게재하거나 음란 사이트를 연결(링크)하는 행위
수치심이나 혐오감 또는 공포심을 일으키는 말, 음향, 글이나 화상 또는 영상을 계속하여 상대방에게 도달하게 하는 행위
스토킹(stalking) 등 다른 회원을 괴롭히는 행위
자기 또는 타인에게 재산상의 이익을 주거나 타인에게 손해를 끼칠 목적으로 거짓된 정보를 유통하는 행위
공공질서와 미풍양속을 거스르는 내용의 부호•문자•소리•화상•동영상 등과 기타 정보 형태의 글, 사진 및 각종 파일과 링크 등을 타인에게 유포하는 행위
본 서비스 운영을 고의로 방해하거나 본 서비스의 안정적 운영을 방해할 수 있는 정보를 전송하고, 수신자의 명시 적인 수신 거부 의사에도 불구하고 광고성 정보를 전송하는 행위
본 서비스와 관련된 설비의 오동작이나 정보 등의 파괴와 혼란을 유발하는 컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해•파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드, 파 일, 프로그램을 포함하고 있는 자료를 등록•판매•게시하거나 이메일(E-mail)로 발송하는 행위
관련 법령에 따라 그 전송 또는 게시가 금지된 정보(컴퓨터 프로그램 포함)를 전송하거나 게시하는 행위
본 서비스의 임의 해지, 재가입 등을 반복적으로 행하여 회사가 제공하는 할인쿠폰, 이벤트 혜택 등의 경제적 이익을 취하는 행위
기타 불법적이거나 부당한 행위
회원은 관계 법령, 본 약관의 규정, 이용안내 및 본 서비스상에 공지한 주의사항, 회사가 통지하는 사항 등을 지켜야 하며, 기타 회사의 업무에 방해되는 행위를 해서는 안 됩니다.
회원은 회사에서 공식적으로 인정한 경우를 제외하고는 본 서비스를 이용하여 상품을 판매하는 영업 활동을 할 수 없으며 특히 해킹, 광고를 통한 수익, 음란 사이트를 통한 상업행위, 상용 소프트웨어 불법 전송 등을 할 수 없습니다. 이를 위반하여 발생한 영업 활동의 결과 및 손실, 관계기관에 의한 구속 등 법적 조치 등에 관해 회사는 책임을 지지 않으며, 이러한 행위로 회사에 손해가 발생하였다면 회원은 회사에 대하여 손해배상 의무를 집니다.
회원이 본 조 제1항에 명시된 행위를 했을 때 회사는 부가적으로 제공한 혜택의 일부 또는 전부의 회수, 특정 서비스의 이용제한, 이용계약의 해지, 손해배상의 청구 등의 조치를 할 수 있습니다.
회사가 본 조 제4항에 정한 조치를 했을 때 회사는 미리 회원에게 유선 또는 이메일(E-mail)로 해당 내용을 통보하며, 회원과 연락할 수 없거나 긴급을 요하는 것과 같이 부득이할 때에는 먼저 조치한 후에 통보할 수 있습니다.
본 조 제4항에 따라 회사가 회원과의 이용계약을 해지하더라도, 해지 이전에 이미 체결된 매매계약 완결에 관해서는 본 약관이 계속 적용됩니다.
본 조 제4항에서 정한 바에 따라 이용계약이 종료될 때에는 회사는 별도 통지 없이 해당 회원과 관련된 거래를 취소할 수 있고, 구매회원이 상품의 결제를 신용카드로 결제했을 때에는 그 신용카드 매출을 취소할 수 있습니다.
본 조 제4항에서 정한 바에 따라 이용계약이 종료되면 회사는 회원의 재이용 신청을 승낙하지 않을 수 있습니다.

제25조 (회원에 대한 통지)
회사는 회원이 등록한 이메일(E-mail) 주소 또는 문자메시지(SMS) 등으로 회원에게 통지할 수 있습니다.  회원이 수정하지 않은 정보로 인하여 발생하는 손해는 당해 회원이 전적으로 부담하며, 회사는 이에 대하여 아무런 책임을 지지 않습니다. 회원이 지정한 이메일 주소 또는 연락처가 없는 경우 또는 회원이 지정한 전자우편주소로 통지할 수 없는 경우에 회사는 제2항에서 정한 방법으로 통지할 수 있습니다.
회사가 불특정 다수 회원에게 통지할 때에는 본 서비스 게시판 등에 게시하는 것으로 개별 통지를 대신할 수 있습니다.

제26조 (ID와 비밀번호 관리에 대한 의무와 책임)
회원은 자신의 아이디(ID)와 비밀번호(PASSWORD)를 철저히 관리해야 합니다. 아이디(ID)와 비밀번호(PASSWORD)의 관리 소홀, 부정 사용으로 발생하는 모든 결과에 대한 책임은 회원 본인에게 있습니다.
회원은 본인의 아이디(ID)와 비밀번호(PASSWORD)를 타인에게 이용하게 해서는 안 되며, 회원 본인의 아이디(ID)와 비밀번호(PASSWORD)를 도난당하거나 타인이 사용하고 있음을 알았을 때에는 바로 회사에 통보하고 회사의 안내가 있으면 그것을 따라야 합니다.

제27조 (개인정보의 변경, 보호)
회원은 이용신청 시 허위의 정보를 제공하여서는 아니 되며, 기재한 사항이 변경되었을 경우에는 즉시 변경사항을 최신의 정보로 수정하여야 합니다. 
정보를 수정하지 않아서 발생하는 손해는 해당 회원이 부담하며, 회사는 이에 대해 아무런 책임을 지지 않습니다.
회사는 관련 법령이 정하는 바에 따라 회원 등록정보를 포함한 회원의 개인정보를 보호하고자 노력합니다. 회원의 개인정보 보호는 관련 법령 및 회사가 정하는 개인정보취급방침에 정한 바를 따릅니다.

제5장 계약해지 및 이용제한
제28조 (계약해지 및 이용제한)
회원은 다음 각 호에서 정한 바에 따라 본 서비스 이용계약을 해지할 수 있습니다.
회원은 언제든지 회사에 이용계약 해지의 의사를 통지하여 이용계약을 해지할 수 있습니다. 단, 해지의사를 통지하기 전에 현재 진행 중인 모든 상품의 거래를 완료하거나 철회 또는 취소해야 하며, 거래를 철회하거나 취소하여 발생하는 불이익은 회원 본인이 부담하여야 합니다.
회원탈퇴로 발생한 불이익은 회원 본인이 책임져야 하며, 이용계약이 종료되면 회사는 회원에게 부가적으로 제공한 각종 혜택을 회수할 수 있습니다.
회사는 제24조 제1항 위반 등을 이유로 회원과의 이용계약을 해지하거나 회원에게 서비스 이용을 제한하고자 할 때에는 미리 그 사유와 내용을 통지합니다. 다만, 제24조 제1항 각 호에 해당하는 행위로서 회원과 연락할 수 없거나 긴급을 요하는 경우에는 먼저 이용계약을 해지하거나 서비스 이용을 제한한 후에 통지할 수 있습니다.
회사는 회원 가입 후 6개월 동안 본 서비스를 사용한 이력이 없는 회원에게는 본 서비스를 이용할지를 묻는 고지를 하고, 회사가 정한 기한 내에 답변이 없으면 이용계약을 해지할 수 있습니다.
본 조 제2항과 제3항의 회사 조치에 대하여 회원은 회사가 정한 절차에 따라 이의를 신청할 수 있습니다.
본 조 제4항의 이의가 정당하다고 회사가 인정하면, 회사는 즉시 본 서비스의 이용을 재개하며, 본 서비스나 콘텐츠에 특정한 이용기간이 있는 등 필요한 때에는 동일한 서비스나 콘텐츠 등을 다시 제공합니다.
환급과 관련하여 회원이 본 조 제1항에 해당하면 회사는 회원의 계약 해지 의사표시에 대하여 회신한 날로부터, 본 조 제2항에 해당하면 회원에게 해지의 의사표시를 한 날로부터 3영업일 이내에 회원의 대금 결제와 동일한 방법으로 환급하고, 동일한 방법으로 환급할 수 없을 때에는 대안을 제시하고 구매회원의 선택에 따라 과오금을 환급합니다. 

제29조 (양도 금지)
회원은 서비스의 이용 권한과, 기타 이용 계약상 지위를 타인에게 양도하거나 증여할 수 없으며, 담보로 제공할 수 없습니다.

제6장 손해배상 등
제30조 (손해배상)
본 약관의 규정을 위반하여 회사에 손해를 끼친 회원은 회사에 발생한 손해를 배상할 책임이 있습니다.
회원이 본 서비스를 이용하면서 불법행위를 하거나 본 약관을 위반하는 행위를 하여 회사가 해당 회원 이외의 제3자로부터 손해배상 청구 또는 소송을 비롯한 각종 이의제기를 받는다면 회사는 우선 이의를 제기한 제3자에게 대응하며, 이 과정에서 회사에 비용과 손해가 발생한다면 회사는 그것과 관련하여 해당 회원에게 구상권을 행사합니다.
회사가 본 서비스를 통하여 직접 통신판매업자로서 판매한 상품의 하자 등으로 회원에게 손해가 발생했을 때 회사는 이를 배상하며, 그 방법과 절차는 전자상거래 등에서의 소비자보호에 관한 법률, 콘텐츠산업진흥법 등 관련 법령, 고시 등을 따릅니다.

제31조 (면책사항)
회사는 천재지변 또는 이에 준하는 불가항력으로 본 서비스를 제공할 수 없는 때에는 본 서비스 제공에 대한 책임이 면제됩니다.
회사는 회원의 귀책사유에 기인한 본 서비스의 이용장애에 대해 책임을 지지 않습니다.
회사는 고의 또는 과실이 없는 한 본 서비스를 이용한 회원이 기대하는 수익을 잃은 것에 대해 책임을 지지 않으며, 그 밖에 본 서비스를 통하여 얻은 자료로 인한 손해 등에 대해서도 책임을 지지 않습니다. 회사는 회원이 홈페이지에 게재한 정보, 자료, 사실의 신뢰도 및 정확성 등의 내용에 대해 책임을 지지 않습니다.
본 서비스를 매개로 회원 상호 간 또는 회원과 제3자 간에 분쟁이 발생했을 때 회사는 그것에 개입할 의무가 없으며, 고의 또는 과실이 없는 한 분쟁으로 인한 손해를 배상할 책임이 없습니다.
회원이 자신의 개인정보를 타인에게 유출하거나 제공하여 발생한 피해에 대해 회사는 고의 또는 과실이 없는 한 일절 책임을 지지 않습니다.
상품 또는 정보 등을 통해 표현하거나 드러나는 회원의 견해와 회사의 견해는 무관하며, 회사는 고의 또는 과실이 없는 한 회원이 제공하는 상품 또는 정보 등에 대하여 어떠한 책임도 부담하지 않습니다.
본 서비스 화면에서 링크, 배너 등을 통하여 연결된 회사(이하 "피연결회사")와 회원 간에 이루어진 거래에 회사는 개입하지 않으며, 고의 또는 과실이 없는 한 해당 거래에 대해 책임을 지지 않습니다.

제32조 (분쟁의 해결, 관할법원)
서비스 이용과 관련하여 회사와 회원 사이에 분쟁이 발생하면, 회사와 회원은 분쟁의 해결을 위해 성실히 협의합니다.
회사와 회원 사이에 분쟁이 발생했을 때 회사 또는 회원은 전자상거래 등에서의 소비자 보호 등에 관한 법률, 콘텐츠산업진흥법 등 관련 법령에서 정하는 분쟁 조정 기구 등에 분쟁조정을 신청할 수 있습니다.
본 조 제1항, 제2항의 협의에서도 분쟁이 해결되지 않아 소송이 제기되었을 때, 관할법원은 민사소송법 등 관련 법령에 따른 관할법원을 1심 관할법원으로 정합니다.

제33조(기타조항)
본 약관과 관련하여 당사자 간의 합의에 의하여 추가로 작성된 계약서, 협정서, 통보서 등과 회사의 정책변경, 법령의 제정·개정 또는 공공기관의 고시·지침 등에 의하여 회사가 회원에게 공지하는 내용도 본 약관의 일부를 구성합니다.

제34조(환불 및 취소정책)
환불 및 취소 정책은 본 약관과 별도로 운영되는 '환불 및 취소 정책'(링크)의 내용이 함께 적용되며, 상호 보완적인 효력을 가집니다.  
 '환불 및 취소 정책'(링크)은 본 약관의 일부로 간주되며, 이용자는 본 서비스를 이용함으로써 해당 정책에 동의한 것으로 간주합니다.


부칙
본 약관은 2025년 [5]월 [15]일부터 시행됩니다.`;

const termsBySeller = `
제1조 (목적)
본 약관은 통신판매중개업자인 블루보이즈클럽(대표자: 현태웅, 이하 “회사”)과, 회사가 운영하는 서비스인 히트비트클럽(이하 “본 서비스”)를 통해 서비스 사용자들에게 상품을 판매하는 판매회원 사이의 권리, 의무를 확정하고 이를 이행함으로써 상호 발전을 도모하는 것을 그 목적으로 합니다.

제2조(용어의 정의)
본 약관에서 사용하는 용어의 정의는 다음 각 호와 같습니다.
본 서비스: 판매회원이 제공하는 상품과 같은 디지털 콘텐츠를 본 약관에 제시된 조건에 따라 구매회원이 구매 또는 이용할 수 있도록 회사에서 제공하는 디지털 콘텐츠 중개 서비스 및 관련 정보 제공•유통 서비스
상품: 회사에서 제공하는 양식에 맞추어 판매회원이 판매 또는 전송을 위하여 등록한 프로그램 또는 콘텐츠, 실물 상품 등을 의미함
회원: 홈페이지 또는 앱에 접속하여 본 약관에 동의하고, 아이디(ID)와 비밀번호(PASSWORD)를 발급받거나 휴대용 단말기 또는 PC용 소프트웨어에서 본 약관에 동의하고, 해당 단말기를 등록하여 본 서비스를 이용할 수 있는 개인이나 법인 고객
구매회원: 본 서비스를 이용하여 상품을 구매하는 고객
판매회원: 본 서비스를 이용하여 상품을 판매하거나 전송하는 개인이나 법인 고객
운영자: 본 서비스의 전반적인 관리와 원활한 운영을 위하여 회사가 선정한 자
게시물: 회원이 본 서비스를 이용하면서 본 서비스에 게시한 부호ㆍ문자ㆍ소리ㆍ화상ㆍ동영상ㆍ기타 정보 형태의 글, 사진 및 각종 파일과 링크
서비스이용료: 본 서비스를 통한 회원의 상품을 구매한 구매자에게 관련 정보 제공•검증•유통한 서비스 이용에 대한 대가로 회사가 회원으로부터 수령하는 금원
본 약관에서 사용하는 용어의 정의는 본 조 제1항에서 정하는 것을 제외하고는 관계 법령과 서비스별 안내에서 정하는 바를 따릅니다.

제3조(약관의 효력 및 변경)
본 약관은 본 서비스를 이용하고자 하는 모든 회원에게 그 효력을 발생합니다.
회사는 필요하다고 인정되면 본 약관을 변경할 수 있으며, 회사가 약관을 변경할 때에는 적용일자와 변경사유를 밝혀 그 적용일자 7일 전부터 공지합니다. 다만, 회원에게 불리한 약관 변경의 경우 그 적용일자 30일 전부터 공지하며, 이메일(E-mail) 또는 문자메시지(SMS) 등으로 회원에게 개별 통지합니다(회원이 연락처를 기재하지 않았거나 변경하여 개별 통지가 어려울 때에는 홈페이지에 변경 약관을 공지하는 것을 개별 통지한 것으로 간주합니다.).
회사가 본 조 제2항에 따라 변경 약관을 공지하거나 통지하면서, 회원이 약관 변경 적용일까지 거부 의사를 표시하지 않으면 약관의 변경에 동의한 것으로 간주한다는 내용을 공지 또는 통지하였음에도 회원이 변경된 약관의 효력 발생일까지 약관 변경에 대한 거부 의사를 표시하지 않을 때에는 회원이 변경 약관에 동의한 것으로 간주합니다. 회원은 변경된 약관에 동의하지 않으면 본 서비스 이용을 중단하고 이용계약을 해지할 수 있습니다.
본 약관에 동의하는 것은 회사가 운영하는 본 서비스의 홈페이지를 정기적으로 방문하여 약관의 변경사항을 확인하는 것에 동의함을 의미합니다. 변경된 약관에 대한 정보를 알지 못하여 발생하는 회원의 피해에 대하여 회사는 책임이 없습니다.
회사는 이용자가 요구하면 본 약관의 사본을 이용자에게 교부하며, 이용자가 홈페이지에서 본 약관을 인쇄할 수 있도록 조치합니다.

제4조(약관 외 준칙)
본 약관에 밝히지 않은 사항은 전기통신기본법, 전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계 법령 및 회사가 정한 서비스의 세부이용지침 등의 규정을 따릅니다.
회사는 본 약관에서 규정되지 않은 세부적인 내용을 회사가 정한 서비스의 세부이용정책(이하 "이용정책"이라 함)에 규정할 수 있고, 이를 앱 또는 홈페이지 통하여 공지하고 회원이 이에 동의한 경우 이용정책은 본 약관과 더불어 판매서비스 이용계약(이하 "이용계약")의 일부를 구성합니다.
회사는 관련 법령의 규정 등에 따라 서비스 중 특정 서비스에 관한 약관(이하 "개별약관")을 별도로 제정할 수 있으며, 회원이 개별약관에 동의한 경우 개별약관은 이용계약의 일부를 구성하고 개별약관에 본 약관과 상충하는 내용이 있을 경우 개별 약관이 우선적으로 적용됩니다.

제5조(판매서비스 이용계약의 성립)
이용계약은 회사가 제공하는 서비스를 이용하고자 하는 자(이하 "가입신청자")의 이용신청에 대하여 회사가 이를 승인함으로써 성립합니다. 회사는 이용 승인의 의사표시를 해당 서비스 화면에 게시하거나 E-mail 또는 기타 방법으로 통지합니다.
판매회원 가입은 만 14세 이상의 개인 또는 사업자(개인사업자 및 법인사업자)가 할 수 있으며, 가입신청자는 실명으로 가입신청을 해야 합니다. 이를 위해 회사는 전문기관을 통한 실명확인 및 본인인증을 요청할 수 있습니다. 실명이 아니거나 타인의 정보를 도용하는 경우 판매서비스 이용이 제한되거나 관련 법령에 의거 처벌받을 수 있습니다.
회사는 가입신청자가 기재한 사항이 운영정책 등과 일치하지 않는 경우 상당한 기한을 정하여 가입신청자에게 정보를 수정 또는 보완할 것을 요구할 수 있습니다.
가입신청자는 본 조 제3항에 따라 회사가 요구한 사항을 수정 또는 보완합니다. 다만, 그 기간 내 수정 또는 보완이 곤란한 경우 회사의 동의를 얻어 그 기간을 연장할 수 있습니다.
회사는 다음과 같은 사유가 발생한 경우, 이용신청에 대한 승인을 거부하거나 유보할 수 있습니다.
회사의 실명확인절차에서 본인의 실명으로 가입하지 않은 것이 확인된 경우
본 조 제4항에 따라 회사가 가입신청자에게 정보의 수정을 요구했음에도 불구하고 그 기간 내에 수정 또는 보완이 이루어지지 않은 경우
회사에 의하여 이용계약이 해지된 날로부터 2개월 이내에 재이용신청을 하는 경우
회사로부터 회원자격 정지 조치 등을 받은 회원이 그 조치기간 중에 이용계약을 임의 해지하고 재이용신청을 하는 경우
설비에 여유가 없거나 기술상 지장이 있는 경우
기타 본 약관에 위배되거나 위법 또는 부당한 이용신청임이 확인된 경우 및 회사가 합리적인 판단에 의하여 필요하다고 인정하는 경우
전 항에 따라 회사가 회원가입 신청의 승낙을 하지 아니하거나 이를 유보한 경우, 회사는 가입신청자에게 이 사실을 통지합니다.
이용계약은 회원가입 절차상 회사가 가입완료를 표시한 시점에 성립합니다.
회사는 판매서비스의 품질 향상 기타 필요한 경우, 판매회원을 등급별로 구분하여 이용시간, 이용횟수, 서비스 메뉴 기타 필요한 사항을 세분하여 그 이용에 차등을 둘 수 있습니다.
판매회원이 본 약관에 동의함은 회사에서 제공하거나 제공할 모든 서비스에 동의하는 것으로 봅니다.
본 약관과 관련하여 회사와 회원 간의 합의에 의하여 추가로 작성된 계약서, 협정서, 약정서 등과 회사의 정책변경, 법령의 제정/개정 또는 공공기관의 고시/지침 등에 의하여 회사가 웹사이트 등을 통해 회원에게 공지하는 내용도 이용계약의 일부를 구성합니다.

제6조(증빙서류)
판매회원은 회원가입 후 판매회원의 상품판매와 판매회원의 신원 및 신용정보 확인 등을 위하여 필요한 자료를 회사가 지정한 장소 및 방법으로 제출하여야 합니다. 이를 지연하여 정산금의 미지급, 회원자격의 정지 등 판매회원에게 발생하는 손해에 대해 판매회원은 회사에게 어떠한 책임도 물을 수 없습니다.

제7조(대리행위 및 보증의 부인)
회사는 효율적인 서비스를 위한 시스템 운영 및 관리 책임만을 부담하며, 상품 거래와 관련하여 회원 또는 구매자를 대리하지 아니하고, 상품의 품질, 완전성, 안정성, 적법성 및 타인의 권리에 대한 비침해성, 회원 사이에 성립된 거래 및 회원이 제공하고 등록한 정보에 대해서는 회사는 어떠한 보증도 하지 않으며 해당 회원이 상품 및 거래 또는 정보에 대한 직접적인 책임을 부담하여야 합니다.

제8조(회사의 의무)
회사는 정당한 사유없이 검색 등에 있어 자신의 상품과 판매회원의 상품을, 또는 판매회원의 상품과 다른 판매회원의 상품을 차별하지 않습니다.
회사는 서비스를 제공할 때 판매회원이 등록한 사항에 대해 회원의 명시적인 동의를 받지 않고 삭제, 변경 또는 추가하지 않습니다. 다만, 회원이 제공한 상품이 선량한 풍속 기타 사회질서에 반하는 내용을 포함하거나 타인의 권리를 침해한 것이 명백한 경우 회사는 회원에게 통지한 후 상품 거래의 중개를 중지할 수 있습니다.
회사는 판매회원이 취급하는 상품의 가격, 거래상대방, 판매량, 영업활동을 부당하게 구속하거나 제한하는 행위를 하지 않습니다.
회사는 판매회원에게 판매 등에 관한 중요한 경영자료(가격, 판매량, 할인율 등 매출에 대한 세부정보를 포함한다)를 부당하게 자신이나 제3자에게 제공하도록 요구하는 행위를 하지 않습니다.
회사는 자신의 고의 또는 과실로 인하여 발생한 손해를 회원에게 전가하는 등 부당하게 손해배상의무를 부담시키지 않습니다.

제9조(상품의 등록 및 판매)
본 서비스에서의 상품의 판매는 판매회원 등록이 완료됨과 동시에 가능하며, 이를 위해서 판매회원은 상품에 관한 정보를 회원툴을 통하여 직접 등록, 관리하여야 합니다. 이 때 상품의 판매가격은 판매회원 스스로 결정합니다.
판매회원은 상품 등록 시 ① 품목별 재화 등에 관한 정보, ② 거래조건에 관한 정보 등 ‘전자상거래 등에서의 상품 등의 정보제공에 관한 고시’(공정거래위원회 고시 제2012-49호, 이하 ‘상품정보제공고시')에서 정한 정보를 입력하여야 하고, 상품 등록 후 상품정보제공고시가 변경되는 경우 그에 맞추어 관련 정보를 수정, 보완하여야 합니다. 판매회원이 상품정보제공고시에 따른 정보를 입력하지 않거나, 상품 등록 후 변경된 상품정보제공고시에 따라 정보를 수정, 보완하지 않는 경우 회사는 신용점수 차감, 상품 판매 제한, 판매회원 ID 중지 등 필요한 조치를 취할 수 있습니다.
판매회원은 상품의 판매와 관련하여 전자상거래법 등 법령이 요구하는 사항 및 회사가 정하는 기준을 준수하여야 하며, 구매자를 대상으로 하는 영업 및 마케팅 등의 행위에 대하여 회사가 제시한 가이드를 준수하여 구매자에게 피해가 발생하지 않도록 합니다.
회사는 판매회원에 대한 사전통지로써 판매자 1인당 물품 등록 건수를 제한할 수 있습니다. 구체적인 제한시기, 내용, 방법 등은 판매회원이 알 수 있도록 사전에 판매회원 화면을 통해 게시합니다. 판매회원이 회사의 물품등록건수 제한 조치를 위반한 경우 회사는 상품등록을 삭제하거나 취소할 수 있고, 상품판매제한, 판매회원 ID 중지 등 필요한 조치를 취할 수 있습니다.
판매회원은 상품의 설명 등 수시로 변동되는 사항에 대한 데이터를 적절히 관리하여야 하며, 판매회원은 데이터를 허위로 기재하거나 방치할 경우 회사가 정한 기준에 따라 처리될 수 있습니다.
판매회원은 회사의 서면에 의한 사전 승인 없이 회사의 상호나 로고 등을 사용할 수 없습니다.
판매회원은 판매된 상품에 대한 보증 서비스를 자신의 책임과 비용으로 실시하여야 합니다. 상품의 판매에는 상품 자체 외에도 상품의 설명, 사용매뉴얼 등 구매자가 상품의 구매 및 사용을 위해 필요한 정보가 포함됩니다.
판매회원은 구매자의 문의에 회사가 정한 기한 내에 성실, 정확히 대답해야 하며, 상품의 공급, 청약철회, 장애발생 등 상품과 관련한 일체의 사항에 대하여 신속하고 성실하게 대응하여야 합니다. 판매회원의 불성실, 부정확한 답변이나 부적절한 대응으로 인하여 구매자에게 발생한 손해에 대해서는 판매회원이 책임을 부담하고, 신속히 회사를 면책시켜야 합니다.
판매회원은 상품의 판매와 관련하여 특정한 인허가 자격이 필요한 경우 이에 대한 요건을 완료한 후 판매상품을 광고 또는 등록해야 합니다. 인허가 자격을 갖추지 않은 상태에서 관련 상품의 판매로 인하여 발생한 모든 민형사상의 책임은 회원 본인에게 있습니다.
판매회원이 회사 등 조직의 구성원인 경우, 판매회원은 해당 조직의 영업기밀 등을 무단으로 활용한 상품을 개발하거나 판매할 수 없습니다.
판매회원이 본 조 제1항 내지 제10항의 회원의 관리의무를 이행하지 않고 회사로부터 시정을 요구 받은 후 7영업일 이내에 이를 시정하지 아니한 경우 회사는 별도의 통고 없이 상품의 판매를 중단 할 수 있습니다.
전자상거래법 제12조부터 제15조까지, 제17조 및 제18조에 따른 책임은 회원이 부담하며, 회사는 이에 따른 책임을 지지 않습니다.

제10조(상품)
판매회원이 서비스를 이용하여 본 서비스에서 판매하는 상품의 저작권 기타 지식재산권은 판매회원에게 있으며, 회사로 그 권리가 이전되지 않습니다. 단, 회사는 아래 각 호의 목적 범위 내에서 상품의 사본을 복제, 전송, 관리, 사용 등을 할 수 있으며, 판매회원으로부터 제공받은 정보(개인정보 제외)를 활용 및 회사의 직원, 자회사 및 계열사, 자문사, 사업 파트너에게 제공할 수 있습니다. 또한 각 호의 목적을 효과적으로 수행하기 위하여, 회사의 직원, 자회사 및 계열사, 사업 파트너에게도 동일한 권리를 부여할 수 있습니다.
상품을 이용자에게 판매 또는 이용 가능하도록 하는 행위
본 서비스의 서비스 운영 및 마케팅
서비스의 마케팅과 상품 마케팅
서비스 개선과 새로운 서비스 개발을 위한 연구
회원은 한국의 '온라인 디지털콘텐츠산업발전법', '저작권법', '상표법', '청소년보호법', '정보통신망법' 및 기타 관련 법령을 준수하여 상품을 제작 및 판매등록하여야 합니다.
회원이 등록한 상품과 관련하여 정보의 오류나 소프트웨어의 장애 등 결함이 발견된 경우 회원은 신속히 결함을 수정하여야 합니다. 신속히 결함이 수정되지 않는 경우 회사는 상품의 판매를 중단 및 이미 판매된 상품의 거래를 취소할 수 있으며 이로 인한 모든 비용은 회원이 부담하여야 합니다.
판매회원이 등록한 상품 및 상품을 설명하기 위한 상호 또는 이미지 등이 타인의 저작권 기타 지식재산권을 비롯한 권리를 침해하는 경우 그에 대한 책임은 회원 본인이 부담합니다.
판매회원은 자신이 제공하거나 등록을 요청한 상호 또는 이미지에 대한 저작권, 상표권 및 기타 일체의 지식재산권 또는 그 사용에 관한 권리를 보유하고 있음을 확인하며, 만약 회사가 제3자에 의해 이미지 및 등록 요청 상호와 관련하여 이의제기나 소송을 당하는 경우, 판매회원은 즉시 회사를 면책시키고 본인의 책임과 비용으로 해당 분쟁을 해결해야 합니다. 또한, 이로 인하여 회사에 손해가 발생하는 경우 해당 손해에 대하여 판매회원에게 배상 책임이 있습니다.
회사는 웹사이트의 관리를 위해 웹사이트 및 앱에 등록된 상품의 배치 및 진열방식을 결정하고, 상품의 판매 및 사용과 관련된 통계를 수집할 수 있습니다.
회사는 다른 웹사이트와의 제휴계약 등을 통해 상품의 판매처를 확대할 수 있습니다. 
판매가 중지된 상품은 본 서비스에서 판매되지 않으나, 회사는 이전 거래의 유지 등 서비스의 관리를 위해 상품을 삭제하지 않고 보관할 수 있습니다.
회사는 상품 판매 촉진을 위하여 할인쿠폰, 포인트 등 할인 수단을 이용하여 상품 가격을 할인할 수 있습니다.

제11조(매매부적합상품)
회사는 다음 각 호의 매매부적합상품은 판매를 금하며, 매매부적합상품을 판매함에 따른 모든 책임은 당해 매매부적합상품을 등록한 판매회원이 부담합니다.
허위 또는 과장 광고한 상품
지식재산권, 상표권 등 타인의 권리를 침해하는 상품
형법, 정보통신망법 등 관련 법령에서 유통을 금지하는 상품
심의되지 않거나 불법 복제된 영상물ㆍ음반ㆍ게임물 등
별도의 '본 서비스 검증가이드라인'에 의해 매매부적합 상품으로 명시된 상품
기타 관계법령에 저촉되는 상품
회사는 매매부적합상품이 발견된 경우 당해 상품의 정보를 삭제하거나 그 판매를 중지시킬 수 있으며, 당해 상품이 이미 판매된 경우 그 거래를 취소할 수 있습니다. 당해 상품을 삭제 또는 판매중지하기 전 회사는 당해 상품의 판매회원에게 이의 제기 방법과 회사가 취할 조치에 관한 정보를 E-mail(전자우편)으로 제공해 드립니다. 취소 이후 판매회원이 취소된 거래와 관련하여 지불한 서비스이용료는 환불되지 않습니다.
회사는 매매부적합상품을 등록한 판매회원의 회원 자격을 정지시키거나 서비스에서 탈퇴시킬 수 있으며, 매매부적합상품으로 인하여 입은 손해의 배상을 당해 회원에게 청구할 수 있습니다.
판매회원이 본 조 제1항의 매매부적합상품 중 제2호와 같이 타인의 지적재산권, 상표권 등을 침해한 경우, 회사는 판매회원을 대신하여 해당 상품의 구매로 인해 권리자에게 발생한 손해에 상당하는 금액(구매대금 및 권리자의 정신적 피해에 대한 보상)을 권리자에게 직접 지급할 수 있습니다. 이 경우 회사는 권리자에게 지급한 구매대금, 정신적 피해에 대한 보상금(금전적 가치로 환산 가능한 수단을 포함한다) 및 위 절차와 관련되어 회사가 지출한 제반 경비를 당해 지적재산권 침해 상품을 판매한 판매회원에게 청구할 수 있습니다.
전 항은 제20조의 회사의 면책을 부인하는 것으로 해석될 수 없습니다.

제12조(상품의 오류 수정, 교환, 환불)
회원은 상품의 하자 또는 사용 상의 안전성에 결함이 있는 경우 전량 리콜(오류 수정, 교환, 환불)하여야 하며, 리콜에 따른 모든 비용을 부담하여야 합니다.
구매회원은 판매회원의 상품 발송 시로부터 배송완료일 후 7일 이내까지 관계법령에 의거하여 반품 또는 교환요청을 할 수 있으며 판매회원은 구매자가 이 기간 내 반품이나 교환을 요청하는 경우 구매자의 요청에 따라 반품 또는 교환을 해 주어야 합니다. 단, 전자상거래법 제17조 제2항 및 기타 법령에 의하여 청약 철회가 제한되어 있는 경우는 예외로 합니다. 또한 상품이 표시 또는 광고 내용과 다를 경우에는 상품수령 후 90일 이내 및 그 사실을 알게 된 날 또는 알 수 있었던 날로부터 30일 이내에 구매자가 반품 또는 교환을 요청하는 경우, 판매회원은 반품 또는 교환을 해 주어야 합니다.
판매회원은 청약철회가 불가능한 상품의 경우에는 해당 사실을 전자상거래법 제17조 제6항에 따라 구매회원이 쉽게 알 수 있는 곳에 명기하여야 하며, 그러하지 않은 경우 단순변심으로 인한 환불기간 등을 명시하여야 합니다.
판매회원은 소비자의 정당한 사유에 따라 청약철회가 가능한 상품임에도 불구하고 회원이 청약철회를 거부하거나, 제9조 제8항에 명기된 회원의 관리의무를 다하지 않는 경우 회사는 직권으로 구매자에게 거래 취소 의사를 확인한 후 회원과 구매자와의 상품의 거래를 취소하거나 상품 판매 중단 등의 조치를 할 수 있습니다.

제13조(서비스 이용료)
서비스 이용료와 서비스 이용료율은 별도의 관리페이지(링크)에 명시되어 있으며, 회사와 회원 간의 협의나 사전 예고를 거쳐 서비스 이용료의 요율 및 정산방법 등이 변경될 수 있습니다. 이 때에는 웹사이트를 통해 전체 회원에게 공지하거나 상품의 종류 등에 따라 해당 회원과의 별도의 약정서를 체결합니다.
회사는 회원의 거래액에 따라 서버이용료를 부과합니다. 서버이용료의 부과기준 등 구체적인 내용은 별도의 관리페이지(링크)에 공지합니다.
서비스 이용료는 회사의 정책에 따라 변경될 수 있으며, 구매자가 쿠폰/포인트/멤버십 등을 사용하여 판매가격을 할인 받은 경우에는 회사는 서비스 이용료 범위 내에서 해당 물품에 대한 서비스 이용료를 할인할 수 있습니다.
서비스이용료는 판매대금에서의 공제, 판매예치금의 사용 등으로 결제할 수 있으며, 회사와 판매회원간의 협의 또는 회사의 내부 사정에 따라 요율, 결제방법 등이 변경될 수 있습니다.

제14조(판매대금 정산)
회사는 월단위로 진행함을 원칙으로 하되, 양 당사자가 체결하는 계약의 내용에 따라 정산주기가 달라질 수 있습니다. 
구매자가 관련 법령의 규정 또는 회사가 정한 환불절차에 따라 상품에 대한 환불을 요청하여 회사가 이를 환불한 상품은 정산 대상에 포함되지 않으며, 회사가 이미 회원에게 정산금을 지급한 경우에는 해당 금액의 반환을 청구하거나 추후 정산할 금액에서 공제할 수 있습니다. 또한, 회사는 관련 법령의 규정, 정부기관의 명령, 권고, 기타 정당한 사유에 의해 거래가 취소된 상품은 정산대상에서 제외할 수 있습니다. 이 경우 회사는 취소된 거래의 내역과 그 근거를 취소일로부터 7일 이내에 판매회원에게 통보합니다.
회사는 직접 또는 제3자(PG사 등)를 통하여 판매회원이 가입 당시 제공한 결제계좌로 전월 1일부터 말일까지의 판매대금에서 카드 결제 수수료, 서비스 이용료, 원천징수세 3.3%, 회사에 대한 기타 채무금을 공제한 나머지 금액을 회원에게 매월 10일 송금합니다. 단, 해당일이 영업일이 아닌 경우 이후 최초 영업일에 송금합니다.
회사가 직접 또는 제3자(PG사 등)를 통하여 본 조 제3항에 의해 회원에게 정산금을 송금하는 경우, 송금 지급일로부터 회원의 상품 판매와 관련하여 구매자에게 갖는 채권을 회사로 양수해 옵니다.
회사는 허위등록 또는 판매과장등록, 허위거래 여부가 의심되는 거래의 해당 내역을 확인하기 위하여 정당거래 사실 확인완료 후 지급할 수 있습니다. 이 경우 회원이 물품판매에 관한 거래사실 증빙서류를 회사에 제공하는 때에는 확인 후 송금처리를 합니다.
판매회원은 주소지 또는 대금결제를 위한 통장계좌 등의 변경이 있을 경우 즉시 회사에 이를 통지하여야 하며, 회사는 통지의 지연 등 회원의 귀책 사유로 인하여 미지급 정산금이 발생한 경우 이를 3년간 보관하나 이 과정에서 회원에게 발생한 손해에 대하여 책임을 지지 않습니다.
회사는 정당한 사유없이 회사의 귀책으로 본 조 제1항에서 정한 정산시기에 정산금을 지급하지 않는 경우 회사는 그 지연기간에 대해 회사가 정한 지연이자율을 곱하여 산정한 지연이자를 지급합니다.본 조 제5항과 제6항을 비롯한 기타 회원의 귀책 사유로 따라 정산이 지연될 경우 회사는 회원에게 지연이자를 지급하지 않습니다.
회사가 솔루션 제공업체와 계약을 통해 회원에게 실시를 허락한 솔루션을 회원이 상품 공급을 위해 사용할 경우, 회사는 회원에게 지급해야 할 판매대금에서 일정비율에 해당하는 금액을 솔루션 사용료로 공제하여 솔루션 제공업체에 지급하고, 나머지 금액을 회원에게 지급합니다. 회사는 회원에게 본 항에 따른 솔루션 사용료 지급비율 및 지급내역을 공개할 수 있습니다.
회사가 판매대금내역을 잘못 산정하여 실제 서비스 이용료보다 과다하게 수령한 경우 그 과오금을 익월 판매회원에게 지급합니다.
회사가 판매대금내역을 잘못 산정하여 실제 서비스 이용료보다 과소하게 수령한 경우 그 차액을 판매회원에게 청구할 수 있습니다. 이 경우 회사는 과소하게 산정한 서비스 이용료에 대한 증명자료를 판매회원에게 제공합니다.
정산은 회원이 등록한 계좌로 지급되며, 계좌정보 오류, 예금주 불일치 등으로 인한 오지급은 회원의 책임입니다.
최소 정산금이 50,000원 미만일 경우 익월로 이월됩니다.

제15조(정산의 보류)
회사는 회원의 귀책사유로 인해 발생한 비용을 판매대금 정산 시 공제할 수 있으며, 회원과의 이용계약 종료 후 당해 회원에게 지급할 판매대금 전액을 이용계약 종료일로부터 3개월 동안 예치하여 동 기간 동안 구매회원으로부터 오류 수정, 환불, 교환 등의 리콜 요구가 발생하는 경우 관련 비용의 지급에 사용할 수 있습니다.
회원의 채권자의 신청에 의한 판매대금의 가압류, 압류 및 추심명령 등 법원의 결정이 있을 경우, 회사는 회원과 채권자 간의 합의 또는 채무 액의 변제 등으로 동 결정이 해제될 때까지 판매대금의 정산을 중지할 수 있습니다.
본 조에 정한 외에도 법률의 규정에 의하거나 합리적인 사유가 있는 경우에는 회사는 회원에게 통지하고 판매대금의 전부 또는 일부에 대한 정산을 일정 기간 유보할 수 있습니다.
회사는 천재지변, 제3자(PG사 등)의 귀책 또는 이에 준하는 불가항력으로 인하여 정산할 수 없는 경우에는 지체에 관한 책임을 부담하지 않습니다.

제16조(납세 관리에 관한 정책 수립)
회사는 부가가치세법 제33조 제2항 및 동 시행령 제84조 제4항의 규정에 근거하여 납세관리에 관한 정책을 수립할 수 있습니다.

제17조(개인정보의 보호)
회원은 서비스의 이용에 따라 취득한 구매자 등 타인의 개인정보를 본 약관에서 정한 목적 이외의 용도로 사용할 수 없으며, 이를 위반할 경우 당해 회원은 관련 법령에 의한 모든 민•형사 상의 법적 책임을 지고 자신의 노력과 비용으로 회사를 면책시켜야 합니다. 회사는 이러한 의무를 위반한 회원에 대하여 당해 회원의 자격을 박탈하고 서비스에서 탈퇴시킬 수 있습니다.
회사는 개인정보 보호를 위하여 회원에게 공개되어 있는 구매자의 개인정보를 상당 기간이 경과한 후 비공개 조치할 수 있습니다.
회사가 개인정보의 보호를 위하여 상당한 주의를 기울였음에도 불구하고, 특정 회원이 본 조 제1항을 위반하여 타인의 개인정보를 유출 또는 오용한 경우 회사는 그에 대하여 아무런 책임을 지지 않습니다.
전기통신사업법, 전자상거래법 등 관련 법령이 규정하는 적법한 절차에 따라 수사관서 등이 회사에 회원에 관한 정보의 제공을 요청한 경우, 회사는 그에 관한 자료를 제출할 수 있습니다.

제18조(계약기간)
이용계약의 기간은 회원이 본 약관에 대해 동의하고 가입한 날로부터 1년까지로 하고, 기간 만료 1개월 전까지 서면에 의한 반대의 의사표시가 없는 한 계약기간은 동일한 조건으로 1년씩 자동 갱신됩니다.

제19조(계약의 해지)
판매회원에게 다음 각 호의 사유가 발생한 경우, 회사는 별도의 최고 없이 해지의 통지를 함으로써 이용계약을 즉시 종료할 수 있습니다.
본 약관 또는 이용계약의 의무를 위반하여 회사로부터 그 시정을 요구받은 후 7일 이내에 이를 시정하지 아니한 경우
부도 등 금융기관의 거래정지, 회생 및 파산절차의 개시 신청, 영업정지 및 취소 등의 행정처분, 주요 자산에 대한 보전처분, 영업양도 및 합병 등으로 상품의 제공 등이 불가능한 경우
공서양속에 반하는 행위 또는 법령 위반 등 회원의 책임 있는 사유로 인하여 회사가 명예 실추 등 유•무형적 손해를 입은 경우
회원의 책임 있는 사유로 최근 2개월간의 거래 중 20% 이상의 거래에서 구매자로부터 오류 수정, 환불, 교환 등의 리콜 요구가 접수된 경우
본 서비스를 정상적인 거래목적이 아닌 위법, 탈법 등 부정한 목적으로 이용하여 본인 또는 제3자에게 부당한 이익을 얻게 하고자 사용하는 경우
회사가 이용계약의 의무를 위반한 경우에 회원은 시정을 요구할 수 있으며, 상당한 기간 내에 회사가 시정하지 않을 경우에 이용계약을 해지할 수 있습니다.
이용계약의 해지에도 불구하고 회원은 해지 시까지 완결되지 않은 상품의 주문의 오류 수정, 교환, 환불 등의 리콜에 필요한 조치를 취하여야 하며, 해지 이전에 이미 판매한 상품과 관련하여 발생한 회원의 책임과 관련된 조항은 그 효력을 유지합니다.
회원이 서비스 이용료의 요율 및 정산방법 등 변경에 동의하지 않는 경우 본 약관 제3조 제3항에 따라 변경 적용일 이전에 거부의사를 표시하고, 이용계약을 해지할 수 있습니다.

제20조(손해배상)
회원 또는 회원의 피고용인, 대리인, 기타 도급 및 위임 등으로 회원을 대신하여 이용계약을 이행하는 자의 책임 있는 사유로 구매자에게 손해가 발생한 경우, 해당 회원은 구매자에게 발생한 손해를 배상할 책임이 있습니다.
회원이 본 약관을 위반함으로써 회사 또는 본 서비스의 대외 이미지 실추 등 회사에 유•무형적 손해가 발생한 경우, 회원은 회사가 입은 손해를 배상하여야 합니다.
회원은 이용계약 해지와 별도로 회사에 대해 손해배상을 청구할 수 있습니다. 다만, 회사가 고의 또는 과실이 없는 경우 이에 해당하지 않습니다.

제21조(회사의 면책)
회사는 웹사이트를 기반으로 한 거래시스템만을 제공할 뿐, 회원이 등록한 상품, 그에 관한 정보 등에 대한 책임은 회원에게 있고, 구매자와의 거래에 관하여 분쟁이 발생한 경우 회사는 그 분쟁에 개입하지 않으며 그 분쟁의 결과로 인한 모든 책임은 회원이 부담합니다. 또한 이와 관련하여 회사가 구매자 또는 제3자에게 손해를 배상하거나 기타 비용을 지출한 경우 회사는 회원에게 구상권을 행사할 수 있습니다.
회사는 적법한 권리자의 요구가 있는 경우에는 당해 상품에 관한 정보를 삭제하거나 수정할 수 있으며, 회원은 이로 인하여 발생한 손해의 배상을 회사에 청구할 수 없습니다.
회사는 전자상거래법 제20조 제2항에 의거하여 회원의 정보를 열람할 수 있는 방법을 구매자에게 제공할 수 있으며, 회원은 당해 정보를 기재하지 아니하거나, 허위로 기재함으로써 발생하는 모든 책임을 부담하여야 합니다.
회사는 컴퓨터 등 정보통신설비의 보수, 점검, 교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있으며, 이와 관련하여 회사는 고의 또는 과실이 없는 한 책임을 지지 않습니다.
판매회원이 자신의 개인정보를 타인에게 유출 또는 제공함으로써 발생하는 피해에 대해서 회사는 일절 책임을 지지 않습니다.
기타 관련 법령 및 회사에서 제공한 이용약관 및 개별약관의 변경, 판매회원 공지사항 등의 주의 의무를 게을리하여 발생한 판매회원의 피해에 대해서 회사는 일절 책임을 지지 않습니다.
판매회원은 판매서비스 이용과 관련된 모든 데이터 및 자료의 보관, 백업, 관리 등의 책임이 있으며, 회사는 이를 보장하지 않습니다.
본 서비스에서의 거래는 실시간으로 진행되지 않을 수도 있습니다. 본 서비스에서의 거래는 판매회원의 현재 소재지와 판매회원이 이용하는 무선 데이터 서비스 제공자의 네트웤 등의 이유로 제한, 지연될 수 있습니다.

제22조(양도 및 권한 위임 금지)
회원은 회사의 동의없이 본 약관상의 권리 또는 의무의 전부 또는 일부를 제3자에게 양도, 위임하거나 담보의 목적으로 제공할 수 없습니다.

제23조(비밀유지)
회사와 회원은 법령상 요구되는 경우를 제외하고는 거래상 취득한 구매자의 정보, 회사의 기술정보, 생산 및 판매계획, 노하우 등 비밀로 관리되는 정보를 구매 자의 사전 동의 없이 제3자에게 누설하여서는 안되며, 그 정보를 이용계약의 이행 이외의 목적으로 이용하여서는 안됩니다.
본 조 제1항의 의무는 이용계약의 종료 후에도 3년간 존속합니다.

제24조(분쟁해결 및 재판관할)
서비스 이용과 관련하여 회사와 회원 사이에 분쟁이 발생한 경우, 회사와 회원은 분쟁의 해결을 위해 성실히 협의합니다.
본 조 제1항의 협의에서도 분쟁이 해결되지 않아 소를 제기하는 경우 관할법원은 민사소송법 등 관련 법령에 따른 관할법원을 제1심 관할법원으로 합니다.

제25조(레퍼럴 수익 정산)
레퍼럴 수익은 추천 코드를 사용한 사용자가 유료 구독 상태를 유지하는 경우에만 정산 대상이 됩니다.
레퍼럴 수익은 회사와 회원 간 사전에 협의된 퍼센트 기준에 따라 지급되며, 해당 퍼센트는 별도 고지 또는 계약을 통해 명시됩니다.
추천 코드를 사용한 사용자가 구독 해지 시 당월까지만 수익이 인정되며 익월부터는 지급되지 않습니다.
레퍼럴 대금 정산에 관한 정책은 제14조(판매대금 정산)에 명기된 세부항에 따라 동일하게 적용됩니다.

제26조(멤버십/구독 서비스 해지 정책)
구독 상품은 결제 즉시 서비스가 개시 되므로 원칙적으로 환불이 불가합니다.
단, 연간 구독 상품의 경우에는 결제일로부터 3개월 이내에 한하여 환불을 요청할 수 있으며, 다음 항목을 공제한 후 잔여 금액에 대해 환불됩니다. 1. 이용 개월 수에 해당하는 할인 혜택이 적용 안된 월간 구독 요금 (1일 이용 시 1개월로 간주) 2. 총 결제금액의 20%에 해당하는 위약금
다음 각 호에 해당하는 경우에는 구독 형태(연간 또는 월간)에 관계없이 환불이 불가합니다. 1. 결제일로부터 3개월을 초과한 경우 2. 이벤트, 프로모션 등을 통해 구독권, 할인, 기타 혜택 등을 이용한 경우

제27조(환불 및 취소정책)
환불 및 취소 정책은 본 약관과 별도로 운영되는 '환불 및 취소 정책'(링크)의 내용이 함께 적용되며, 상호 보완적인 효력을 가집니다.  
 '환불 및 취소 정책'(링크)은 본 약관의 일부로 간주되며, 이용자는 본 서비스를 이용함으로써 해당 정책에 동의한 것으로 간주합니다.

[부칙]
본 약관은 2025년 [5]월 [15]일부터 적용 됩니다.
`;
const PolicyTermsContent = () => {
	return (
		<section className="pt-4 px-[54.5px] pb-[65px]">
			<div className="text-[#87878A] font-suit text-xs font-bold leading-[150%] tracking-[0.12px] whitespace-pre-wrap">
				<div className="text-black text-base font-bold leading-[150%] tracking-[0.12px] mt-10">
					히트비트클럽 서비스 이용약관
				</div>
				{terms.split("\n").map((line, idx) => (
					<Fragment key={idx}>
						{line}
						<br />
					</Fragment>
				))}
				<div className="text-black text-base font-bold leading-[150%] tracking-[0.12px] mt-10">
					히트비트클럽 판매회원 이용약관
				</div>
				{termsBySeller.split("\n").map((line, idx) => (
					<Fragment key={idx}>
						{line}
						<br />
					</Fragment>
				))}
			</div>
		</section>
	);
};

export default PolicyTermsContent;
